#version: 0.2 - Trained by `huggingface/tokenizers`
c c
C C
( =
cc c
C c
+ ]
CC C
cc ccc
N H
N C
O C
n c
CC CC
) (
C l
cc cc
O c
N c
) [
- ]
( -
-] )
O CC
C Oc
) (=
( [
n H
) =
B r
CC N
+] (
C N
c n
CC CCC
CC c
C OC
+] )
s c
C O
1 2
n n
N CC
n cc
C S
CC OC
+] (=
2 1
o c
c nc
C NC
N Cc
CCCC CCCC
n nc
CC OCC
O Cc
C n
CC Oc
CCC N
2 3
C OCC
CC NC
S C
ccc nc
CC O
CS c
CC S
3 2
cc nc
N S
CCCC CC
S i
ccc s
CC n
C Nc
N N
cc n
] (
c sc
)= [
+] =
S c
cccc n
cn n
CC Cc
CCC O
ccc o
c s
N CCC
nc nc
cc ncc
S CC
n o
n oc
= [
N NC
n ccc
N CCc
O CCC
nc n
CCC NC
)( [
3 4
OC O
OCC O
cn cc
cc sc
n cccc
CCC Oc
CC l
CS C
CC Nc
CCCC CCC
CCCC N
S Cc
ccc n
4 3
OCC OCC
CCC n
s ccc
(= [
CO Cc
F c
+] ([
CCCC CCCCC
CCC OC
O CCCC
o n
CCC S
C Br
CCCCCCCC CCCCCCCC
CC SC
-] )[
CN S
CCCC O
ncc n
CCCC c
Cl c
CCC Nc
ncc s
N O
CO P
c oc
cc oc
4 5
F C
cnc n
CCS c
CS CC
COCC N
) -
O P
1 3
CCCC Oc
CCCC NC
cc nn
nn n
nccc n
-]) =
cn ccc
N CCCC
CCS CC
CO CCC
N Nc
nn nn
O S
CCCCCCCC CCCC
CCN S
+] )(
cn nc
5 4
CCC l
CCCCCCCC CC
cn ccn
O N
OCC OC
O CCCO
ncc nc
s cc
OCC c
NCC NC
nn nc
CCCC OC
o ccc
1 0
CS CCC
N OC
CCCCCCCC CCC
N CCN
OCC N
OCC Oc
N n
Br c
CS Cc
+]= [
CCCC n
3 1
n s
NCC Cc
nc nn
n sc
-] )(
o nc
cn nn
O O
OCC NC
C F
COCC NC
NCC Oc
CCCC S
nnc n
CO N
c o
CCCCC N
OC OC
OCCOCC OCCOCC
cnc nc
cs cn
NCC n
# [
CCC OCC
NCC O
COCC n
N CCCCC
5 6
] [
NCC S
CCO P
-] #[
1 1
CCCCCCCC CCCCC
nc sc
C P
S CCC
CCCCCCCC CCCCCC
CCCCC NC
CCCC Cc
O B
2 4
6 5
COCC Oc
Si H
NCCC n
no nc
CC OCc
CCCCC Oc
NCC OC
nn cc
CC Br
CCCCCCCC CCCCCCC
C H
CCC Sc
N CCCN
ccnc n
S e
CCCCCCCC CCCCCCCCC
CCCCCCCCCCCCCCCC CC
NCC Nc
cnc s
OCC n
sc nc
CO CCCNC
CCCC CCOc
COCC OC
ns nc
OCC CCC
COCC O
CCCN S
cc on
O CCCCCC
CCCC l
C I
OCC Cc
cs cc
CO CCCN
CCC SC
CO S
nn sc
-] =[
CCCC CCc
s ccn
ccc nn
N OCC
O CCCCCCCC
+] )=
nc ncc
CN CC
CCCC Nc
NCCC OC
O OC
N OCc
6 7
CCO CCC
N P
4 2
OCCC NC
S S
1 4
S n
CO CCCC
s nc
nnc s
CCCC CCN
NCC OCC
N CCCCCC
COCC c
CCCCC O
] (=
CCCCC OC
COCC OCC
N CCCO
cn oc
nc oc
o cc
CCCCC n
3 5
NCCC OCC
S CCS
7 6
COCC Nc
Cl C
OCCC Oc
+] )[
CO NC
s nnc
] )
CCCC CCNC
NCCC NC
CCCC OCC
CCCCCCCC c
CCCCCCCC Oc
s n
CCO CCCNC
CCCCCCCCCCCCCCCC CCC
-] )([
NCC SCc
CS CCN
ccn o
nc on
OCC S
CC F
ncc o
CCCCCCCCCCCCCCCC CCCCC
NCC Sc
O CCCCCCCCCCCC
OCCC OC
CCN CC
cnc o
CC P
CCO N
OCCC n
S CCN
CCS Cc
OO O
N NS
B c
NCC OCCOCC
CCC SCC
COCC OCCOCC
OCCOCCOCCOCC OCCOCCOCCOCC
cs nn
CCOCC Oc
CCOCC N
cc nnc
COC Oc
Cl Cc
oc nc
CCC Br
NCCC Oc
S CCCC
CN N
N CCNS
CO CCCn
CN NC
CCCC CCCOc
OCC Nc
CCCC CCOC
o ncc
CCCC Sc
CCS CCC
O CCCN
COC OC
CCOCC OC
S CCCS
O NC
CCO S
OCC OCCO
CCCCC Nc
O n
A s
CCCCCC Cc
CCC OCc
-] [
CCCCCCCC OC
-] (
1 5
CCOCC n
NCC SC
CCOCC O
C B
CS CCS
S OOO
CCCC CCO
I c
7 8
cnn s
S N
CS CN
CS SCC
NCCC S
CCOCC OCCOCC
OCCC l
CCCCCCCC N
5 3
CCCCCC n
O CCCCCCCCCC
OCC Sc
CCCCCCCCCCCCCCCC CCCC
nnc o
OC n
S CCOc
s e
OCCC S
CCCCC l
CCCO CCC
CCCCCCCC CCOc
CO CCCNc
Br C
8 7
CCC F
CO CCCOc
B C
CCCC NS
4 1
CCCCCCCC CCCCOc
OC N
S CCc
NC N
CCCCC S
Cl CC
S CCNC
ncn s
S CCO
CCCC CCCN
4 6
S Sc
CCCCCCCC Cc
CCO CCCC
1 6
N NCC
6 4
G e
OC Oc
OC OCC
nn ccc
CCCCCCCC CCCCc
CCOCC OCC
OCCOCC OC
O CCCCCCC
CCCCCCCC CCc
OCCCC Oc
CCO CCCN
N CCCCc
COCC NS
NCC OCCO
cn sn
NCCC Nc
CCO NC
SCC SC
COCC S
CCOCC NC
O CCCCCCCCC
P c
CCCCCCC OC
OCC F
CCCCCCCCCCCC OC
T e
N CCCCCCC
+] [
CS CCNC
OCCCC O
CS CCO
OCCCC OC
CCCCCCCCCCCCCCCC CCCCCC
S SC
OCCC Nc
CN Cc
OCCCC n
OCCCC CCOc
OCCOCC OCCOC
COCC OCCNC
nc no
CCCCCCCC CCOC
CCOC n
CCCC SC
(- [
CCCCCCCC NC
+] (-
+] #
CCCCCCCCC OC
CS CCCC
COC O
I H
( #
COCC CCC
NCCCC n
co cn
CO O
N Oc
N NCc
NCCC l
1 7
A l
O CCCCCCCCCCCCCCCC
CCCCCC Nc
COCC Cc
CCN Cc
Br CC
CCCC OCCCNC
CCS S
CCOCC c
CCCC Br
COCC OCCC
NS c
CCC P
NCCCCC O
OCC SC
CCCO P
8 9
OCC OCCC
NCCC Sc
CCO CCCn
OCCCC CCOC
2 5
OCC NS
OCCOCC Oc
NC l
cccc cc
CCCCCCCCC Oc
CCCC OCCC
OCC OCc
NCCCC CCNC
N CCCCO
N CCCCCCCC
P C
CC I
c onc
CCCC CCCNC
CCCCCCCCCCCCCCCC CCCCCCC
COC N
OCCCC c
OC F
SS SS
] ([
OCC Br
CN n
CO B
Br Cc
CCC OCCOC
] )(
1 8
OCC CCCOc
CO CCCS
CCCCO P
CCCCC Sc
OO OO
CO n
+] #[
3 7
no cc
9 8
COC n
co cc
] =
OCCOCC OCCO
CCCCCCCC n
N CCCCN
OC P
CN CCS
O CCCCCCCCCCC
CCCC OCCOCC
H g
NCCCC Cc
CCN N
N CCCCNC
S CCCCC
CO OC
OCCCC NC
CCC SCc
NCC F
CCOCC S
CCCCC NS
CCCC OCc
CCCCCCCCCCCCCCCC CCCCCCCC
CCCO N
CCCCCCCCCCCC CCOc
N CCCCOc
NCCC OCc
CCOCC Nc
OC NC
NO S
OCCOCCOCCOCCOCCOCCOCCOCC OCCOCCOCCOCCOCCOCCOCCOCC
CCOCC OCCOCCOCCOCC
NC NC
CCCCCCCCCCCCCCCC CCOC
CCCCCCCCCCCCCCCC OC
OCCOCC OCCOCCO
N SC
5 7
COCC OCc
CCCCCCCC CCCCN
CO NCc
CCCC P
CCCCCCCC CCCCNC
CCCC CCOCC
CCC NCC
S CCCc
O CCCCN
1 9
O Oc
5 2
COCC OCCOC
NCCCC CCO
O F
CCCC CCS
CCCCC Br
CCCCCCCC CCCc
NCCC OCCO
31 4
O CCCCCCCCCCCCCCCCCC
COC OCC
NCCOCCOCC NC
CCCCCCCCCCCC CCOC
S CCOC
S CCCO
cn sc
ncnc n
CS N
COCC OCCCC
OCCCC l
NCCCN S
CCCCCCCCCCCCCCCC CCCCCCCCCCCCCCCC
S NC
ccn s
B B
7 5
CCCCCCCC CCCOC
NCC OCc
CCO CCCNc
CCCCCCCCCCCCCC Cc
s ncc
NCCCC SC
2 0
NCCCC l
S CCCN
CCCCC OCC
CCCO S
Cl CCc
CS CCCNC
COCC OCCOc
P P
NC S
CCCCCCCCCCCCCCCC CCCCCCCCC
O OCC
CCCC SCC
nnn s
OC l
CCCC OCCOc
CCCCCC l
5 1
CCCCCCCC CCN
CS CCc
S CCCCCC
CCCCCCCC CCNC
CCCCCCC n
OC OCc
CCCCCCCCCCCCCCCC CCNC
CN CCC
S P
NCCC SC
I C
CO CCCOC
NCCS CCCO
CCS CCNC
- %
O CCCCCCCCCCCCCC
N CCCCCCCCCCCC
NCC OCCOC
CN OC
COCCOCCOCC OC
CCC OCCOCC
CCCCCCCCCCCCCCCC Oc
cc sn
CCCCCCCCCCCCCCCC CCN
OCCCC Cc
P H
COCC OCCOCCOCCOCC
CCCCCCCC Nc
NCCC OCCOC
CS CCOc
CCC I
CCOCC OCCOC
S H
CCCCCCCCC N
NC Oc
NCCC OCCOCC
CCCC OCCOC
CS SC
NCCCC OC
CC B
OCCC Sc
O Nc
-]) =[
CS CCn
s sc
CCC OCCOc
OCO P
CCCCCCCCCCCCCCCC OCC
n scc
ncc nn
NCC OCCC
OCC l
COCC Sc
OCCCC CCO
NC O
F CC
CCS SCC
O I
OCCC OCC
CCOCC OCCNC
OCCOCC OCCOc
CCCCC SC
3 6
S CN
OCCC Br
COCCOCCOCC Oc
CCS CCN
S CCn
OC S
10 9
