{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[UNK]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "cc": 261,
      "CC": 262,
      "(=": 263,
      "ccc": 264,
      "Cc": 265,
      "+]": 266,
      "CCC": 267,
      "ccccc": 268,
      "NH": 269,
      "NC": 270,
      "OC": 271,
      "nc": 272,
      "CCCC": 273,
      ")(": 274,
      "Cl": 275,
      "cccc": 276,
      "Oc": 277,
      "Nc": 278,
      ")[": 279,
      "-]": 280,
      "(-": 281,
      "-])": 282,
      "OCC": 283,
      "COc": 284,
      ")(=": 285,
      "([": 286,
      "nH": 287,
      ")=": 288,
      "Br": 289,
      "CCN": 290,
      "+](": 291,
      "CN": 292,
      "cn": 293,
      "CCCCC": 294,
      "CCc": 295,
      "COC": 296,
      "+])": 297,
      "sc": 298,
      "CO": 299,
      "12": 300,
      "nn": 301,
      "NCC": 302,
      "ncc": 303,
      "CS": 304,
      "CCOC": 305,
      "+](=": 306,
      "21": 307,
      "oc": 308,
      "cnc": 309,
      "CNC": 310,
      "NCc": 311,
      "CCCCCCCC": 312,
      "nnc": 313,
      "CCOCC": 314,
      "OCc": 315,
      "Cn": 316,
      "CCOc": 317,
      "CCCN": 318,
      "23": 319,
      "COCC": 320,
      "CCNC": 321,
      "SC": 322,
      "cccnc": 323,
      "CCO": 324,
      "CSc": 325,
      "CCS": 326,
      "32": 327,
      "ccnc": 328,
      "NS": 329,
      "CCCCCC": 330,
      "Si": 331,
      "cccs": 332,
      "CCn": 333,
      "CNc": 334,
      "NN": 335,
      "ccn": 336,
      "](": 337,
      "csc": 338,
      ")=[": 339,
      "+]=": 340,
      "Sc": 341,
      "ccccn": 342,
      "cnn": 343,
      "CCCc": 344,
      "CCCO": 345,
      "ccco": 346,
      "cs": 347,
      "NCCC": 348,
      "ncnc": 349,
      "ccncc": 350,
      "SCC": 351,
      "no": 352,
      "noc": 353,
      "=[": 354,
      "NNC": 355,
      "nccc": 356,
      "NCCc": 357,
      "OCCC": 358,
      "ncn": 359,
      "CCCNC": 360,
      ")([": 361,
      "34": 362,
      "OCO": 363,
      "OCCO": 364,
      "cncc": 365,
      "ccsc": 366,
      "ncccc": 367,
      "CCCOc": 368,
      "CCl": 369,
      "CSC": 370,
      "CCNc": 371,
      "CCCCCCC": 372,
      "CCCCN": 373,
      "SCc": 374,
      "cccn": 375,
      "43": 376,
      "OCCOCC": 377,
      "CCCn": 378,
      "sccc": 379,
      "(=[": 380,
      "COCc": 381,
      "Fc": 382,
      "+]([": 383,
      "CCCCCCCCC": 384,
      "CCCOC": 385,
      "OCCCC": 386,
      "on": 387,
      "CCCS": 388,
      "CBr": 389,
      "CCCCCCCCCCCCCCCC": 390,
      "CCSC": 391,
      "-])[": 392,
      "CNS": 393,
      "CCCCO": 394,
      "nccn": 395,
      "CCCCc": 396,
      "Clc": 397,
      "CCCNc": 398,
      "nccs": 399,
      "NO": 400,
      "COP": 401,
      "coc": 402,
      "ccoc": 403,
      "45": 404,
      "FC": 405,
      "cncn": 406,
      "CCSc": 407,
      "CSCC": 408,
      "COCCN": 409,
      ")-": 410,
      "OP": 411,
      "13": 412,
      "CCCCOc": 413,
      "CCCCNC": 414,
      "ccnn": 415,
      "nnn": 416,
      "ncccn": 417,
      "-])=": 418,
      "cnccc": 419,
      "NCCCC": 420,
      "CCSCC": 421,
      "COCCC": 422,
      "NNc": 423,
      "nnnn": 424,
      "OS": 425,
      "CCCCCCCCCCCC": 426,
      "CCNS": 427,
      "+])(": 428,
      "cnnc": 429,
      "54": 430,
      "CCCl": 431,
      "CCCCCCCCCC": 432,
      "cnccn": 433,
      "ON": 434,
      "OCCOC": 435,
      "OCCCO": 436,
      "nccnc": 437,
      "scc": 438,
      "OCCc": 439,
      "NCCNC": 440,
      "nnnc": 441,
      "CCCCOC": 442,
      "occc": 443,
      "10": 444,
      "CSCCC": 445,
      "NOC": 446,
      "CCCCCCCCCCC": 447,
      "NCCN": 448,
      "OCCN": 449,
      "OCCOc": 450,
      "Nn": 451,
      "Brc": 452,
      "CSCc": 453,
      "+]=[": 454,
      "CCCCn": 455,
      "31": 456,
      "ns": 457,
      "NCCCc": 458,
      "ncnn": 459,
      "nsc": 460,
      "-])(": 461,
      "onc": 462,
      "cnnn": 463,
      "OO": 464,
      "OCCNC": 465,
      "CF": 466,
      "COCCNC": 467,
      "NCCOc": 468,
      "CCCCS": 469,
      "nncn": 470,
      "CON": 471,
      "co": 472,
      "CCCCCN": 473,
      "OCOC": 474,
      "OCCOCCOCCOCC": 475,
      "cncnc": 476,
      "cscn": 477,
      "NCCn": 478,
      "#[": 479,
      "CCCOCC": 480,
      "NCCO": 481,
      "COCCn": 482,
      "NCCCCC": 483,
      "56": 484,
      "][": 485,
      "NCCS": 486,
      "CCOP": 487,
      "-]#[": 488,
      "11": 489,
      "CCCCCCCCCCCCC": 490,
      "ncsc": 491,
      "CP": 492,
      "SCCC": 493,
      "CCCCCCCCCCCCCC": 494,
      "CCCCCNC": 495,
      "CCCCCc": 496,
      "OB": 497,
      "24": 498,
      "65": 499,
      "COCCOc": 500,
      "SiH": 501,
      "NCCCn": 502,
      "nonc": 503,
      "CCOCc": 504,
      "CCCCCOc": 505,
      "NCCOC": 506,
      "nncc": 507,
      "CCBr": 508,
      "CCCCCCCCCCCCCCC": 509,
      "CH": 510,
      "CCCSc": 511,
      "NCCCN": 512,
      "ccncn": 513,
      "Se": 514,
      "CCCCCCCCCCCCCCCCC": 515,
      "CCCCCCCCCCCCCCCCCC": 516,
      "NCCNc": 517,
      "cncs": 518,
      "OCCn": 519,
      "scnc": 520,
      "COCCCNC": 521,
      "CCCCCCOc": 522,
      "COCCOC": 523,
      "nsnc": 524,
      "OCCCCC": 525,
      "COCCO": 526,
      "CCCNS": 527,
      "ccon": 528,
      "OCCCCCC": 529,
      "CCCCl": 530,
      "CI": 531,
      "OCCCc": 532,
      "cscc": 533,
      "COCCCN": 534,
      "CCCSC": 535,
      "COS": 536,
      "nnsc": 537,
      "-]=[": 538,
      "CCCCCCc": 539,
      "sccn": 540,
      "cccnn": 541,
      "NOCC": 542,
      "OCCCCCCCC": 543,
      "+])=": 544,
      "ncncc": 545,
      "CNCC": 546,
      "CCCCNc": 547,
      "NCCCOC": 548,
      "OOC": 549,
      "NOCc": 550,
      "67": 551,
      "CCOCCC": 552,
      "NP": 553,
      "42": 554,
      "OCCCNC": 555,
      "SS": 556,
      "14": 557,
      "Sn": 558,
      "COCCCC": 559,
      "snc": 560,
      "nncs": 561,
      "CCCCCCN": 562,
      "NCCOCC": 563,
      "NCCCCCC": 564,
      "COCCc": 565,
      "CCCCCO": 566,
      "](=": 567,
      "CCCCCOC": 568,
      "COCCOCC": 569,
      "NCCCO": 570,
      "cnoc": 571,
      "ncoc": 572,
      "occ": 573,
      "CCCCCn": 574,
      "35": 575,
      "NCCCOCC": 576,
      "SCCS": 577,
      "76": 578,
      "COCCNc": 579,
      "ClC": 580,
      "OCCCOc": 581,
      "+])[": 582,
      "CONC": 583,
      "snnc": 584,
      "])": 585,
      "CCCCCCNC": 586,
      "NCCCNC": 587,
      "CCCCOCC": 588,
      "CCCCCCCCc": 589,
      "CCCCCCCCOc": 590,
      "sn": 591,
      "CCOCCCNC": 592,
      "CCCCCCCCCCCCCCCCCCC": 593,
      "-])([": 594,
      "NCCSCc": 595,
      "CSCCN": 596,
      "ccno": 597,
      "ncon": 598,
      "OCCS": 599,
      "CCF": 600,
      "ncco": 601,
      "CCCCCCCCCCCCCCCCCCCCC": 602,
      "NCCSc": 603,
      "OCCCCCCCCCCCC": 604,
      "OCCCOC": 605,
      "CCNCC": 606,
      "cnco": 607,
      "CCP": 608,
      "CCON": 609,
      "OCCCn": 610,
      "SCCN": 611,
      "CCSCc": 612,
      "OOO": 613,
      "NNS": 614,
      "Bc": 615,
      "NCCOCCOCC": 616,
      "CCCSCC": 617,
      "COCCOCCOCC": 618,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 619,
      "csnn": 620,
      "CCOCCOc": 621,
      "CCOCCN": 622,
      "ccnnc": 623,
      "COCOc": 624,
      "ClCc": 625,
      "ocnc": 626,
      "CCCBr": 627,
      "NCCCOc": 628,
      "SCCCC": 629,
      "CNN": 630,
      "NCCNS": 631,
      "COCCCn": 632,
      "CNNC": 633,
      "CCCCCCCOc": 634,
      "OCCNc": 635,
      "CCCCCCOC": 636,
      "oncc": 637,
      "CCCCSc": 638,
      "CCSCCC": 639,
      "OCCCN": 640,
      "COCOC": 641,
      "CCOCCOC": 642,
      "SCCCS": 643,
      "ONC": 644,
      "CCOS": 645,
      "OCCOCCO": 646,
      "CCCCCNc": 647,
      "On": 648,
      "As": 649,
      "CCCCCCCc": 650,
      "CCCOCc": 651,
      "-][": 652,
      "CCCCCCCCOC": 653,
      "-](": 654,
      "15": 655,
      "CCOCCn": 656,
      "NCCSC": 657,
      "CCOCCO": 658,
      "CB": 659,
      "CSCCS": 660,
      "SOOO": 661,
      "CCCCCCO": 662,
      "Ic": 663,
      "78": 664,
      "cnns": 665,
      "SN": 666,
      "CSCN": 667,
      "CSSCC": 668,
      "NCCCS": 669,
      "CCOCCOCCOCC": 670,
      "OCCCl": 671,
      "CCCCCCCCN": 672,
      "53": 673,
      "CCCCCCn": 674,
      "OCCCCCCCCCC": 675,
      "OCCSc": 676,
      "CCCCCCCCCCCCCCCCCCCC": 677,
      "nnco": 678,
      "OCn": 679,
      "SCCOc": 680,
      "se": 681,
      "OCCCS": 682,
      "CCCCCl": 683,
      "CCCOCCC": 684,
      "CCCCCCCCCCOc": 685,
      "COCCCNc": 686,
      "BrC": 687,
      "87": 688,
      "CCCF": 689,
      "COCCCOc": 690,
      "BC": 691,
      "CCCCNS": 692,
      "41": 693,
      "CCCCCCCCCCCCOc": 694,
      "OCN": 695,
      "SCCc": 696,
      "NCN": 697,
      "CCCCCS": 698,
      "ClCC": 699,
      "SCCNC": 700,
      "ncns": 701,
      "SCCO": 702,
      "CCCCCCCN": 703,
      "46": 704,
      "SSc": 705,
      "CCCCCCCCCc": 706,
      "CCOCCCC": 707,
      "16": 708,
      "NNCC": 709,
      "64": 710,
      "Ge": 711,
      "OCOc": 712,
      "OCOCC": 713,
      "nnccc": 714,
      "CCCCCCCCCCCCc": 715,
      "CCOCCOCC": 716,
      "OCCOCCOC": 717,
      "OCCCCCCC": 718,
      "CCCCCCCCCCc": 719,
      "OCCCCOc": 720,
      "CCOCCCN": 721,
      "NCCCCc": 722,
      "COCCNS": 723,
      "NCCOCCO": 724,
      "cnsn": 725,
      "NCCCNc": 726,
      "CCONC": 727,
      "SCCSC": 728,
      "COCCS": 729,
      "CCOCCNC": 730,
      "OCCCCCCCCC": 731,
      "Pc": 732,
      "CCCCCCCOC": 733,
      "OCCF": 734,
      "CCCCCCCCCCCCOC": 735,
      "Te": 736,
      "NCCCCCCC": 737,
      "+][": 738,
      "CSCCNC": 739,
      "OCCCCO": 740,
      "CSCCO": 741,
      "OCCCCOC": 742,
      "CCCCCCCCCCCCCCCCCCCCCC": 743,
      "SSC": 744,
      "OCCCNc": 745,
      "CNCc": 746,
      "OCCCCn": 747,
      "OCCCCCCOc": 748,
      "OCCOCCOCCOC": 749,
      "COCCOCCNC": 750,
      "ncno": 751,
      "CCCCCCCCCCOC": 752,
      "CCOCn": 753,
      "CCCCSC": 754,
      "(-[": 755,
      "CCCCCCCCNC": 756,
      "+](-": 757,
      "+]#": 758,
      "CCCCCCCCCOC": 759,
      "CSCCCC": 760,
      "COCO": 761,
      "IH": 762,
      "(#": 763,
      "COCCCCC": 764,
      "NCCCCn": 765,
      "cocn": 766,
      "COO": 767,
      "NOc": 768,
      "NNCc": 769,
      "NCCCl": 770,
      "17": 771,
      "Al": 772,
      "OCCCCCCCCCCCCCCCC": 773,
      "CCCCCCNc": 774,
      "COCCCc": 775,
      "CCNCc": 776,
      "BrCC": 777,
      "CCCCOCCCNC": 778,
      "CCSS": 779,
      "CCOCCc": 780,
      "CCCCBr": 781,
      "COCCOCCC": 782,
      "NSc": 783,
      "CCCP": 784,
      "NCCCCCO": 785,
      "OCCSC": 786,
      "CCCOP": 787,
      "89": 788,
      "OCCOCCC": 789,
      "NCCCSc": 790,
      "CCOCCCn": 791,
      "OCCCCCCOC": 792,
      "25": 793,
      "OCCNS": 794,
      "OCCOCCOc": 795,
      "NCl": 796,
      "cccccc": 797,
      "CCCCCCCCCOc": 798,
      "CCCCOCCC": 799,
      "OCCOCc": 800,
      "NCCCCCCNC": 801,
      "NCCCCO": 802,
      "NCCCCCCCC": 803,
      "PC": 804,
      "CCI": 805,
      "conc": 806,
      "CCCCCCCNC": 807,
      "CCCCCCCCCCCCCCCCCCCCCCC": 808,
      "COCN": 809,
      "OCCCCc": 810,
      "OCF": 811,
      "SSSS": 812,
      "]([": 813,
      "OCCBr": 814,
      "CNn": 815,
      "COB": 816,
      "BrCc": 817,
      "CCCOCCOC": 818,
      "])(": 819,
      "18": 820,
      "OCCCCCOc": 821,
      "COCCCS": 822,
      "CCCCOP": 823,
      "CCCCCSc": 824,
      "OOOO": 825,
      "COn": 826,
      "+]#[": 827,
      "37": 828,
      "nocc": 829,
      "98": 830,
      "COCn": 831,
      "cocc": 832,
      "]=": 833,
      "OCCOCCOCCO": 834,
      "CCCCCCCCn": 835,
      "NCCCCN": 836,
      "OCP": 837,
      "CNCCS": 838,
      "OCCCCCCCCCCC": 839,
      "CCCCOCCOCC": 840,
      "Hg": 841,
      "NCCCCCc": 842,
      "CCNN": 843,
      "NCCCCNC": 844,
      "SCCCCC": 845,
      "COOC": 846,
      "OCCCCNC": 847,
      "CCCSCc": 848,
      "NCCF": 849,
      "CCOCCS": 850,
      "CCCCCNS": 851,
      "CCCCOCc": 852,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 853,
      "CCCON": 854,
      "CCCCCCCCCCCCCCOc": 855,
      "NCCCCOc": 856,
      "NCCCOCc": 857,
      "CCOCCNc": 858,
      "OCNC": 859,
      "NOS": 860,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 861,
      "CCOCCOCCOCCOCCOCC": 862,
      "NCNC": 863,
      "CCCCCCCCCCCCCCCCCCOC": 864,
      "CCCCCCCCCCCCCCCCOC": 865,
      "OCCOCCOCCOCCO": 866,
      "NSC": 867,
      "57": 868,
      "COCCOCc": 869,
      "CCCCCCCCCCCCN": 870,
      "CONCc": 871,
      "CCCCP": 872,
      "CCCCCCCCCCCCNC": 873,
      "CCCCCCOCC": 874,
      "CCCNCC": 875,
      "SCCCc": 876,
      "OCCCCN": 877,
      "19": 878,
      "OOc": 879,
      "52": 880,
      "COCCOCCOC": 881,
      "NCCCCCCO": 882,
      "OF": 883,
      "CCCCCCS": 884,
      "CCCCCBr": 885,
      "CCCCCCCCCCCc": 886,
      "NCCCOCCO": 887,
      "314": 888,
      "OCCCCCCCCCCCCCCCCCC": 889,
      "COCOCC": 890,
      "NCCOCCOCCNC": 891,
      "CCCCCCCCCCCCCCOC": 892,
      "SCCOC": 893,
      "SCCCO": 894,
      "cnsc": 895,
      "ncncn": 896,
      "CSN": 897,
      "COCCOCCCC": 898,
      "OCCCCl": 899,
      "NCCCNS": 900,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 901,
      "SNC": 902,
      "ccns": 903,
      "BB": 904,
      "75": 905,
      "CCCCCCCCCCCOC": 906,
      "NCCOCc": 907,
      "CCOCCCNc": 908,
      "CCCCCCCCCCCCCCCc": 909,
      "sncc": 910,
      "NCCCCSC": 911,
      "20": 912,
      "NCCCCl": 913,
      "SCCCN": 914,
      "CCCCCOCC": 915,
      "CCCOS": 916,
      "ClCCc": 917,
      "CSCCCNC": 918,
      "COCCOCCOc": 919,
      "PP": 920,
      "NCS": 921,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 922,
      "OOCC": 923,
      "CCCCSCC": 924,
      "nnns": 925,
      "OCl": 926,
      "CCCCOCCOc": 927,
      "CCCCCCl": 928,
      "51": 929,
      "CCCCCCCCCCN": 930,
      "CSCCc": 931,
      "SCCCCCC": 932,
      "CCCCCCCCCCNC": 933,
      "CCCCCCCn": 934,
      "OCOCc": 935,
      "CCCCCCCCCCCCCCCCCCNC": 936,
      "CNCCC": 937,
      "SP": 938,
      "NCCCSC": 939,
      "IC": 940,
      "COCCCOC": 941,
      "NCCSCCCO": 942,
      "CCSCCNC": 943,
      "-%": 944,
      "OCCCCCCCCCCCCCC": 945,
      "NCCCCCCCCCCCC": 946,
      "NCCOCCOC": 947,
      "CNOC": 948,
      "COCCOCCOCCOC": 949,
      "CCCOCCOCC": 950,
      "CCCCCCCCCCCCCCCCOc": 951,
      "ccsn": 952,
      "CCCCCCCCCCCCCCCCCCN": 953,
      "OCCCCCc": 954,
      "PH": 955,
      "COCCOCCOCCOCCOCC": 956,
      "CCCCCCCCNc": 957,
      "NCCCOCCOC": 958,
      "CSCCOc": 959,
      "CCCI": 960,
      "CCOCCOCCOC": 961,
      "SH": 962,
      "CCCCCCCCCN": 963,
      "NCOc": 964,
      "NCCCOCCOCC": 965,
      "CCCCOCCOC": 966,
      "CSSC": 967,
      "NCCCCOC": 968,
      "CCB": 969,
      "OCCCSc": 970,
      "ONc": 971,
      "-])=[": 972,
      "CSCCn": 973,
      "ssc": 974,
      "CCCOCCOc": 975,
      "OCOP": 976,
      "CCCCCCCCCCCCCCCCOCC": 977,
      "nscc": 978,
      "nccnn": 979,
      "NCCOCCC": 980,
      "OCCl": 981,
      "COCCSc": 982,
      "OCCCCCCO": 983,
      "NCO": 984,
      "FCC": 985,
      "CCSSCC": 986,
      "OI": 987,
      "OCCCOCC": 988,
      "CCOCCOCCNC": 989,
      "OCCOCCOCCOc": 990,
      "CCCCCSC": 991,
      "36": 992,
      "SCN": 993,
      "OCCCBr": 994,
      "COCCOCCOCCOc": 995,
      "CCSCCN": 996,
      "SCCn": 997,
      "OCS": 998,
      "109": 999
    },
    "merges": [
      "c c",
      "C C",
      "( =",
      "cc c",
      "C c",
      "+ ]",
      "CC C",
      "cc ccc",
      "N H",
      "N C",
      "O C",
      "n c",
      "CC CC",
      ") (",
      "C l",
      "cc cc",
      "O c",
      "N c",
      ") [",
      "- ]",
      "( -",
      "-] )",
      "O CC",
      "C Oc",
      ") (=",
      "( [",
      "n H",
      ") =",
      "B r",
      "CC N",
      "+] (",
      "C N",
      "c n",
      "CC CCC",
      "CC c",
      "C OC",
      "+] )",
      "s c",
      "C O",
      "1 2",
      "n n",
      "N CC",
      "n cc",
      "C S",
      "CC OC",
      "+] (=",
      "2 1",
      "o c",
      "c nc",
      "C NC",
      "N Cc",
      "CCCC CCCC",
      "n nc",
      "CC OCC",
      "O Cc",
      "C n",
      "CC Oc",
      "CCC N",
      "2 3",
      "C OCC",
      "CC NC",
      "S C",
      "ccc nc",
      "CC O",
      "CS c",
      "CC S",
      "3 2",
      "cc nc",
      "N S",
      "CCCC CC",
      "S i",
      "ccc s",
      "CC n",
      "C Nc",
      "N N",
      "cc n",
      "] (",
      "c sc",
      ")= [",
      "+] =",
      "S c",
      "cccc n",
      "cn n",
      "CC Cc",
      "CCC O",
      "ccc o",
      "c s",
      "N CCC",
      "nc nc",
      "cc ncc",
      "S CC",
      "n o",
      "n oc",
      "= [",
      "N NC",
      "n ccc",
      "N CCc",
      "O CCC",
      "nc n",
      "CCC NC",
      ")( [",
      "3 4",
      "OC O",
      "OCC O",
      "cn cc",
      "cc sc",
      "n cccc",
      "CCC Oc",
      "CC l",
      "CS C",
      "CC Nc",
      "CCCC CCC",
      "CCCC N",
      "S Cc",
      "ccc n",
      "4 3",
      "OCC OCC",
      "CCC n",
      "s ccc",
      "(= [",
      "CO Cc",
      "F c",
      "+] ([",
      "CCCC CCCCC",
      "CCC OC",
      "O CCCC",
      "o n",
      "CCC S",
      "C Br",
      "CCCCCCCC CCCCCCCC",
      "CC SC",
      "-] )[",
      "CN S",
      "CCCC O",
      "ncc n",
      "CCCC c",
      "Cl c",
      "CCC Nc",
      "ncc s",
      "N O",
      "CO P",
      "c oc",
      "cc oc",
      "4 5",
      "F C",
      "cnc n",
      "CCS c",
      "CS CC",
      "COCC N",
      ") -",
      "O P",
      "1 3",
      "CCCC Oc",
      "CCCC NC",
      "cc nn",
      "nn n",
      "nccc n",
      "-]) =",
      "cn ccc",
      "N CCCC",
      "CCS CC",
      "CO CCC",
      "N Nc",
      "nn nn",
      "O S",
      "CCCCCCCC CCCC",
      "CCN S",
      "+] )(",
      "cn nc",
      "5 4",
      "CCC l",
      "CCCCCCCC CC",
      "cn ccn",
      "O N",
      "OCC OC",
      "O CCCO",
      "ncc nc",
      "s cc",
      "OCC c",
      "NCC NC",
      "nn nc",
      "CCCC OC",
      "o ccc",
      "1 0",
      "CS CCC",
      "N OC",
      "CCCCCCCC CCC",
      "N CCN",
      "OCC N",
      "OCC Oc",
      "N n",
      "Br c",
      "CS Cc",
      "+]= [",
      "CCCC n",
      "3 1",
      "n s",
      "NCC Cc",
      "nc nn",
      "n sc",
      "-] )(",
      "o nc",
      "cn nn",
      "O O",
      "OCC NC",
      "C F",
      "COCC NC",
      "NCC Oc",
      "CCCC S",
      "nnc n",
      "CO N",
      "c o",
      "CCCCC N",
      "OC OC",
      "OCCOCC OCCOCC",
      "cnc nc",
      "cs cn",
      "NCC n",
      "# [",
      "CCC OCC",
      "NCC O",
      "COCC n",
      "N CCCCC",
      "5 6",
      "] [",
      "NCC S",
      "CCO P",
      "-] #[",
      "1 1",
      "CCCCCCCC CCCCC",
      "nc sc",
      "C P",
      "S CCC",
      "CCCCCCCC CCCCCC",
      "CCCCC NC",
      "CCCC Cc",
      "O B",
      "2 4",
      "6 5",
      "COCC Oc",
      "Si H",
      "NCCC n",
      "no nc",
      "CC OCc",
      "CCCCC Oc",
      "NCC OC",
      "nn cc",
      "CC Br",
      "CCCCCCCC CCCCCCC",
      "C H",
      "CCC Sc",
      "N CCCN",
      "ccnc n",
      "S e",
      "CCCCCCCC CCCCCCCCC",
      "CCCCCCCCCCCCCCCC CC",
      "NCC Nc",
      "cnc s",
      "OCC n",
      "sc nc",
      "CO CCCNC",
      "CCCC CCOc",
      "COCC OC",
      "ns nc",
      "OCC CCC",
      "COCC O",
      "CCCN S",
      "cc on",
      "O CCCCCC",
      "CCCC l",
      "C I",
      "OCC Cc",
      "cs cc",
      "CO CCCN",
      "CCC SC",
      "CO S",
      "nn sc",
      "-] =[",
      "CCCC CCc",
      "s ccn",
      "ccc nn",
      "N OCC",
      "O CCCCCCCC",
      "+] )=",
      "nc ncc",
      "CN CC",
      "CCCC Nc",
      "NCCC OC",
      "O OC",
      "N OCc",
      "6 7",
      "CCO CCC",
      "N P",
      "4 2",
      "OCCC NC",
      "S S",
      "1 4",
      "S n",
      "CO CCCC",
      "s nc",
      "nnc s",
      "CCCC CCN",
      "NCC OCC",
      "N CCCCCC",
      "COCC c",
      "CCCCC O",
      "] (=",
      "CCCCC OC",
      "COCC OCC",
      "N CCCO",
      "cn oc",
      "nc oc",
      "o cc",
      "CCCCC n",
      "3 5",
      "NCCC OCC",
      "S CCS",
      "7 6",
      "COCC Nc",
      "Cl C",
      "OCCC Oc",
      "+] )[",
      "CO NC",
      "s nnc",
      "] )",
      "CCCC CCNC",
      "NCCC NC",
      "CCCC OCC",
      "CCCCCCCC c",
      "CCCCCCCC Oc",
      "s n",
      "CCO CCCNC",
      "CCCCCCCCCCCCCCCC CCC",
      "-] )([",
      "NCC SCc",
      "CS CCN",
      "ccn o",
      "nc on",
      "OCC S",
      "CC F",
      "ncc o",
      "CCCCCCCCCCCCCCCC CCCCC",
      "NCC Sc",
      "O CCCCCCCCCCCC",
      "OCCC OC",
      "CCN CC",
      "cnc o",
      "CC P",
      "CCO N",
      "OCCC n",
      "S CCN",
      "CCS Cc",
      "OO O",
      "N NS",
      "B c",
      "NCC OCCOCC",
      "CCC SCC",
      "COCC OCCOCC",
      "OCCOCCOCCOCC OCCOCCOCCOCC",
      "cs nn",
      "CCOCC Oc",
      "CCOCC N",
      "cc nnc",
      "COC Oc",
      "Cl Cc",
      "oc nc",
      "CCC Br",
      "NCCC Oc",
      "S CCCC",
      "CN N",
      "N CCNS",
      "CO CCCn",
      "CN NC",
      "CCCC CCCOc",
      "OCC Nc",
      "CCCC CCOC",
      "o ncc",
      "CCCC Sc",
      "CCS CCC",
      "O CCCN",
      "COC OC",
      "CCOCC OC",
      "S CCCS",
      "O NC",
      "CCO S",
      "OCC OCCO",
      "CCCCC Nc",
      "O n",
      "A s",
      "CCCCCC Cc",
      "CCC OCc",
      "-] [",
      "CCCCCCCC OC",
      "-] (",
      "1 5",
      "CCOCC n",
      "NCC SC",
      "CCOCC O",
      "C B",
      "CS CCS",
      "S OOO",
      "CCCC CCO",
      "I c",
      "7 8",
      "cnn s",
      "S N",
      "CS CN",
      "CS SCC",
      "NCCC S",
      "CCOCC OCCOCC",
      "OCCC l",
      "CCCCCCCC N",
      "5 3",
      "CCCCCC n",
      "O CCCCCCCCCC",
      "OCC Sc",
      "CCCCCCCCCCCCCCCC CCCC",
      "nnc o",
      "OC n",
      "S CCOc",
      "s e",
      "OCCC S",
      "CCCCC l",
      "CCCO CCC",
      "CCCCCCCC CCOc",
      "CO CCCNc",
      "Br C",
      "8 7",
      "CCC F",
      "CO CCCOc",
      "B C",
      "CCCC NS",
      "4 1",
      "CCCCCCCC CCCCOc",
      "OC N",
      "S CCc",
      "NC N",
      "CCCCC S",
      "Cl CC",
      "S CCNC",
      "ncn s",
      "S CCO",
      "CCCC CCCN",
      "4 6",
      "S Sc",
      "CCCCCCCC Cc",
      "CCO CCCC",
      "1 6",
      "N NCC",
      "6 4",
      "G e",
      "OC Oc",
      "OC OCC",
      "nn ccc",
      "CCCCCCCC CCCCc",
      "CCOCC OCC",
      "OCCOCC OC",
      "O CCCCCCC",
      "CCCCCCCC CCc",
      "OCCCC Oc",
      "CCO CCCN",
      "N CCCCc",
      "COCC NS",
      "NCC OCCO",
      "cn sn",
      "NCCC Nc",
      "CCO NC",
      "SCC SC",
      "COCC S",
      "CCOCC NC",
      "O CCCCCCCCC",
      "P c",
      "CCCCCCC OC",
      "OCC F",
      "CCCCCCCCCCCC OC",
      "T e",
      "N CCCCCCC",
      "+] [",
      "CS CCNC",
      "OCCCC O",
      "CS CCO",
      "OCCCC OC",
      "CCCCCCCCCCCCCCCC CCCCCC",
      "S SC",
      "OCCC Nc",
      "CN Cc",
      "OCCCC n",
      "OCCCC CCOc",
      "OCCOCC OCCOC",
      "COCC OCCNC",
      "nc no",
      "CCCCCCCC CCOC",
      "CCOC n",
      "CCCC SC",
      "(- [",
      "CCCCCCCC NC",
      "+] (-",
      "+] #",
      "CCCCCCCCC OC",
      "CS CCCC",
      "COC O",
      "I H",
      "( #",
      "COCC CCC",
      "NCCCC n",
      "co cn",
      "CO O",
      "N Oc",
      "N NCc",
      "NCCC l",
      "1 7",
      "A l",
      "O CCCCCCCCCCCCCCCC",
      "CCCCCC Nc",
      "COCC Cc",
      "CCN Cc",
      "Br CC",
      "CCCC OCCCNC",
      "CCS S",
      "CCOCC c",
      "CCCC Br",
      "COCC OCCC",
      "NS c",
      "CCC P",
      "NCCCCC O",
      "OCC SC",
      "CCCO P",
      "8 9",
      "OCC OCCC",
      "NCCC Sc",
      "CCO CCCn",
      "OCCCC CCOC",
      "2 5",
      "OCC NS",
      "OCCOCC Oc",
      "NC l",
      "cccc cc",
      "CCCCCCCCC Oc",
      "CCCC OCCC",
      "OCC OCc",
      "NCCCC CCNC",
      "N CCCCO",
      "N CCCCCCCC",
      "P C",
      "CC I",
      "c onc",
      "CCCC CCCNC",
      "CCCCCCCCCCCCCCCC CCCCCCC",
      "COC N",
      "OCCCC c",
      "OC F",
      "SS SS",
      "] ([",
      "OCC Br",
      "CN n",
      "CO B",
      "Br Cc",
      "CCC OCCOC",
      "] )(",
      "1 8",
      "OCC CCCOc",
      "CO CCCS",
      "CCCCO P",
      "CCCCC Sc",
      "OO OO",
      "CO n",
      "+] #[",
      "3 7",
      "no cc",
      "9 8",
      "COC n",
      "co cc",
      "] =",
      "OCCOCC OCCO",
      "CCCCCCCC n",
      "N CCCCN",
      "OC P",
      "CN CCS",
      "O CCCCCCCCCCC",
      "CCCC OCCOCC",
      "H g",
      "NCCCC Cc",
      "CCN N",
      "N CCCCNC",
      "S CCCCC",
      "CO OC",
      "OCCCC NC",
      "CCC SCc",
      "NCC F",
      "CCOCC S",
      "CCCCC NS",
      "CCCC OCc",
      "CCCCCCCCCCCCCCCC CCCCCCCC",
      "CCCO N",
      "CCCCCCCCCCCC CCOc",
      "N CCCCOc",
      "NCCC OCc",
      "CCOCC Nc",
      "OC NC",
      "NO S",
      "OCCOCCOCCOCCOCCOCCOCCOCC OCCOCCOCCOCCOCCOCCOCCOCC",
      "CCOCC OCCOCCOCCOCC",
      "NC NC",
      "CCCCCCCCCCCCCCCC CCOC",
      "CCCCCCCCCCCCCCCC OC",
      "OCCOCC OCCOCCO",
      "N SC",
      "5 7",
      "COCC OCc",
      "CCCCCCCC CCCCN",
      "CO NCc",
      "CCCC P",
      "CCCCCCCC CCCCNC",
      "CCCC CCOCC",
      "CCC NCC",
      "S CCCc",
      "O CCCCN",
      "1 9",
      "O Oc",
      "5 2",
      "COCC OCCOC",
      "NCCCC CCO",
      "O F",
      "CCCC CCS",
      "CCCCC Br",
      "CCCCCCCC CCCc",
      "NCCC OCCO",
      "31 4",
      "O CCCCCCCCCCCCCCCCCC",
      "COC OCC",
      "NCCOCCOCC NC",
      "CCCCCCCCCCCC CCOC",
      "S CCOC",
      "S CCCO",
      "cn sc",
      "ncnc n",
      "CS N",
      "COCC OCCCC",
      "OCCCC l",
      "NCCCN S",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCCCCC",
      "S NC",
      "ccn s",
      "B B",
      "7 5",
      "CCCCCCCC CCCOC",
      "NCC OCc",
      "CCO CCCNc",
      "CCCCCCCCCCCCCC Cc",
      "s ncc",
      "NCCCC SC",
      "2 0",
      "NCCCC l",
      "S CCCN",
      "CCCCC OCC",
      "CCCO S",
      "Cl CCc",
      "CS CCCNC",
      "COCC OCCOc",
      "P P",
      "NC S",
      "CCCCCCCCCCCCCCCC CCCCCCCCC",
      "O OCC",
      "CCCC SCC",
      "nnn s",
      "OC l",
      "CCCC OCCOc",
      "CCCCCC l",
      "5 1",
      "CCCCCCCC CCN",
      "CS CCc",
      "S CCCCCC",
      "CCCCCCCC CCNC",
      "CCCCCCC n",
      "OC OCc",
      "CCCCCCCCCCCCCCCC CCNC",
      "CN CCC",
      "S P",
      "NCCC SC",
      "I C",
      "CO CCCOC",
      "NCCS CCCO",
      "CCS CCNC",
      "- %",
      "O CCCCCCCCCCCCCC",
      "N CCCCCCCCCCCC",
      "NCC OCCOC",
      "CN OC",
      "COCCOCCOCC OC",
      "CCC OCCOCC",
      "CCCCCCCCCCCCCCCC Oc",
      "cc sn",
      "CCCCCCCCCCCCCCCC CCN",
      "OCCCC Cc",
      "P H",
      "COCC OCCOCCOCCOCC",
      "CCCCCCCC Nc",
      "NCCC OCCOC",
      "CS CCOc",
      "CCC I",
      "CCOCC OCCOC",
      "S H",
      "CCCCCCCCC N",
      "NC Oc",
      "NCCC OCCOCC",
      "CCCC OCCOC",
      "CS SC",
      "NCCCC OC",
      "CC B",
      "OCCC Sc",
      "O Nc",
      "-]) =[",
      "CS CCn",
      "s sc",
      "CCC OCCOc",
      "OCO P",
      "CCCCCCCCCCCCCCCC OCC",
      "n scc",
      "ncc nn",
      "NCC OCCC",
      "OCC l",
      "COCC Sc",
      "OCCCC CCO",
      "NC O",
      "F CC",
      "CCS SCC",
      "O I",
      "OCCC OCC",
      "CCOCC OCCNC",
      "OCCOCC OCCOc",
      "CCCCC SC",
      "3 6",
      "S CN",
      "OCCC Br",
      "COCCOCCOCC Oc",
      "CCS CCN",
      "S CCn",
      "OC S",
      "10 9"
    ]
  }
}