{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Nmt"
      },
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Metaspace",
        "replacement": "▁",
        "add_prefix_space": true
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 2,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "c",
        -1.0815473943056428
      ],
      [
        "(",
        -2.39525720519158
      ],
      [
        ")",
        -2.39525720519158
      ],
      [
        "1",
        -2.724204911343999
      ],
      [
        "n",
        -2.7928642491036424
      ],
      [
        "2",
        -3.0794470228725723
      ],
      [
        "o",
        -3.127856488604376
      ],
      [
        "]",
        -3.3714085145347212
      ],
      [
        "[",
        -3.3714085145347212
      ],
      [
        "@",
        -3.440329308565425
      ],
      [
        "h",
        -3.4607158892127874
      ],
      [
        "=",
        -3.4989514295235224
      ],
      [
        "3",
        -4.13095707832787
      ],
      [
        "+",
        -4.641303392495734
      ],
      [
        "▁",
        -4.777118763347636
      ],
      [
        "f",
        -4.893302243991889
      ],
      [
        "s",
        -5.081198591438216
      ],
      [
        "cc",
        -5.085356176245985
      ],
      [
        "-",
        -5.1928673659107005
      ],
      [
        "▁cc",
        -5.243555583377833
      ],
      [
        "ccc",
        -5.39578836010478
      ],
      [
        "4",
        -5.73752143347039
      ],
      [
        "l",
        -5.819096892238881
      ],
      [
        "▁c",
        -5.917745908856039
      ],
      [
        "▁coc",
        -6.0107872364814545
      ],
      [
        "cccc",
        -6.156280301487181
      ],
      [
        "nc",
        -6.459304780620106
      ],
      [
        "#",
        -6.540410952898057
      ],
      [
        "br",
        -6.773598527415569
      ],
      [
        "ccn",
        -7.0551605405440085
      ],
      [
        "▁ccoc",
        -7.251752719292707
      ],
      [
        "ccccc",
        -7.263496987424712
      ],
      [
        "cn",
        -7.430296617022466
      ],
      [
        "cl",
        -7.439671328209381
      ],
      [
        "/",
        -7.476845662977304
      ],
      [
        "▁o",
        -7.51491987059628
      ],
      [
        "▁ccn",
        -7.550608326209542
      ],
      [
        "▁ccc",
        -7.655119514014767
      ],
      [
        "▁cn",
        -7.715766801832563
      ],
      [
        "oc",
        -7.752225229441439
      ],
      [
        "sc",
        -7.862305980284431
      ],
      [
        "▁co",
        -8.093389573570537
      ],
      [
        "csc",
        -8.254595179753004
      ],
      [
        "cccs",
        -8.293898159807345
      ],
      [
        "cco",
        -8.314870435487483
      ],
      [
        "▁cccn",
        -8.345282304546428
      ],
      [
        "cccn",
        -8.427162765904965
      ],
      [
        "cs",
        -8.489116577788094
      ],
      [
        "ccs",
        -8.58153612994088
      ],
      [
        "coc",
        -8.633268731289547
      ],
      [
        "5",
        -8.659946697886472
      ],
      [
        "ncc",
        -8.678869892925562
      ],
      [
        "nn",
        -8.719272297892598
      ],
      [
        "ccoc",
        -8.79194851755495
      ],
      [
        "\\",
        -8.802803840783575
      ],
      [
        "nnn",
        -8.843401298152065
      ],
      [
        "cnc",
        -8.866705696671376
      ],
      [
        "ccco",
        -8.933359156825981
      ],
      [
        "ccnc",
        -9.068816639099811
      ],
      [
        "co",
        -9.07669350247031
      ],
      [
        "▁cco",
        -9.113479356080692
      ],
      [
        "▁cs",
        -9.214617189267685
      ],
      [
        "ns",
        -9.26003912401188
      ],
      [
        "nccn",
        -9.281551100577053
      ],
      [
        "occo",
        -9.52990877926313
      ],
      [
        "▁ccco",
        -9.578686190793848
      ],
      [
        "occ",
        -9.584974694251368
      ],
      [
        "▁cccc",
        -9.656380000427989
      ],
      [
        "▁ccs",
        -9.656738659671763
      ],
      [
        "ccocc",
        -9.658514698731176
      ],
      [
        "nnc",
        -9.8167098346994
      ],
      [
        "▁cocc",
        -9.820464604364028
      ],
      [
        "▁coccn",
        -9.865475775217153
      ],
      [
        "▁coccoc",
        -10.11836459127426
      ],
      [
        "▁ccoccn",
        -10.133916624153944
      ],
      [
        "▁ccccoc",
        -10.201852671954953
      ],
      [
        "▁ccnc",
        -10.578503915593952
      ],
      [
        "nccc",
        -10.594829258860107
      ],
      [
        "▁ccccn",
        -10.700946886803967
      ],
      [
        "cocc",
        -10.878475416510302
      ],
      [
        "scc",
        -11.007517385697913
      ],
      [
        "▁nc",
        -11.183276326836731
      ],
      [
        "i",
        -11.252803840783574
      ],
      [
        "▁cccco",
        -11.313685746150227
      ],
      [
        "▁n",
        -11.398277374703293
      ],
      [
        "cnn",
        -11.420303011342003
      ],
      [
        "ccccn",
        -11.973206745959214
      ],
      [
        "r",
        -12.230229278634708
      ],
      [
        "b",
        -12.230329278634708
      ],
      [
        "ncn",
        -12.230329278634708
      ]
    ]
  }
}