{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Nmt"
      },
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Metaspace",
        "replacement": "▁",
        "add_prefix_space": true
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 2,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "C",
        -1.9340620265308672
      ],
      [
        "c",
        -2.005135123981894
      ],
      [
        "(",
        -2.3305416341016603
      ],
      [
        ")",
        -2.3305416341016603
      ],
      [
        "1",
        -2.659489340254079
      ],
      [
        "2",
        -3.0147314517826524
      ],
      [
        "O",
        -3.1705660462226426
      ],
      [
        "[",
        -3.306692943444802
      ],
      [
        "]",
        -3.306692943444802
      ],
      [
        "N",
        -3.3379525475363145
      ],
      [
        "@",
        -3.375613737475505
      ],
      [
        "H",
        -3.3960003181228675
      ],
      [
        "=",
        -3.4342358584336026
      ],
      [
        "n",
        -3.9996436484078526
      ],
      [
        "3",
        -4.06624150723795
      ],
      [
        "+",
        -4.576587821405814
      ],
      [
        "ccc",
        -4.581329068949029
      ],
      [
        "cccc",
        -4.794168477161054
      ],
      [
        "F",
        -4.844444469349959
      ],
      [
        "▁C",
        -4.930731418706828
      ],
      [
        "-",
        -5.128151794820781
      ],
      [
        "CC",
        -5.188054847421639
      ],
      [
        "▁",
        -5.243375183264383
      ],
      [
        "▁CC",
        -5.43665410318811
      ],
      [
        "cc",
        -5.5072446210190025
      ],
      [
        "S",
        -5.607990514129369
      ],
      [
        "CCC",
        -5.610845771534943
      ],
      [
        "4",
        -5.6728058623804705
      ],
      [
        "CCN",
        -5.984229431727735
      ],
      [
        "▁CO",
        -6.136725098692515
      ],
      [
        "s",
        -6.163972117410355
      ],
      [
        "l",
        -6.244242813422003
      ],
      [
        "nc",
        -6.260369976115333
      ],
      [
        "Cl",
        -6.290410301999481
      ],
      [
        "NC",
        -6.301741325285668
      ],
      [
        "#",
        -6.475695381808137
      ],
      [
        "CCCC",
        -6.630889749196983
      ],
      [
        "Br",
        -6.708882955827546
      ],
      [
        "o",
        -6.8821690990922
      ],
      [
        "no",
        -7.085301372799254
      ],
      [
        "nn",
        -7.118314757276034
      ],
      [
        "CN",
        -7.148023077707201
      ],
      [
        "▁O",
        -7.184905330255651
      ],
      [
        "CCO",
        -7.223262672570245
      ],
      [
        "▁CN",
        -7.340957119808042
      ],
      [
        "ccs",
        -7.358439269448935
      ],
      [
        "▁CCC",
        -7.384181818093239
      ],
      [
        "OC",
        -7.401588967543118
      ],
      [
        "/",
        -7.412130091887384
      ],
      [
        "▁COC",
        -7.453342081307827
      ],
      [
        "nnc",
        -7.47808245293119
      ],
      [
        "cccn",
        -7.526117466256242
      ],
      [
        "▁CCOC",
        -7.581460400684975
      ],
      [
        "sc",
        -7.587476370908391
      ],
      [
        "cco",
        -7.601812309424911
      ],
      [
        "CCOCC",
        -7.70962259415791
      ],
      [
        "CCCN",
        -7.716050546596486
      ],
      [
        "oc",
        -7.769503317151609
      ],
      [
        "ccnc",
        -7.885377075776418
      ],
      [
        "▁CCO",
        -7.958354042052764
      ],
      [
        "cs",
        -7.963618836898842
      ],
      [
        "▁CCN",
        -7.969745690077621
      ],
      [
        "NCC",
        -7.982831223650717
      ],
      [
        "CNC",
        -8.015812540478318
      ],
      [
        "CCCO",
        -8.02283744281797
      ],
      [
        "nccn",
        -8.023781204384559
      ],
      [
        "CCCCC",
        -8.11341034971395
      ],
      [
        "csc",
        -8.123340128859315
      ],
      [
        "nnn",
        -8.16923209155111
      ],
      [
        "CO",
        -8.197076591417558
      ],
      [
        "cnc",
        -8.24948897316689
      ],
      [
        "OCC",
        -8.337244843539171
      ],
      [
        "ncc",
        -8.353509885017871
      ],
      [
        "CCNC",
        -8.374584543880333
      ],
      [
        "cnn",
        -8.379764985534148
      ],
      [
        "▁CCCC",
        -8.408946579060395
      ],
      [
        "ccn",
        -8.441316367356151
      ],
      [
        "▁CCCN",
        -8.45594045326705
      ],
      [
        "ncn",
        -8.509281787409483
      ],
      [
        "CCOC",
        -8.545791064619088
      ],
      [
        "5",
        -8.595231126796552
      ],
      [
        "OCCO",
        -8.620568633537287
      ],
      [
        "SCC",
        -8.675945846432539
      ],
      [
        "\\",
        -8.738088269693655
      ],
      [
        "▁CS",
        -8.745760398405789
      ],
      [
        "cn",
        -8.81287462848524
      ],
      [
        "CS",
        -8.852680543942768
      ],
      [
        "COC",
        -8.901532120821837
      ],
      [
        "▁CCCO",
        -8.971729419021525
      ],
      [
        "▁COCC",
        -8.986602855501445
      ],
      [
        "▁F",
        -9.08172188898926
      ],
      [
        "▁CCNC",
        -9.213239929783953
      ],
      [
        "nccc",
        -9.267617565078302
      ],
      [
        "▁CCS",
        -9.284123840101111
      ],
      [
        "▁N",
        -9.46465900903722
      ],
      [
        "▁CCCCO",
        -9.549659454320029
      ],
      [
        "NCCC",
        -9.592808545839066
      ],
      [
        "NCCN",
        -9.616093114468232
      ],
      [
        "CCS",
        -9.685688435303312
      ],
      [
        "cncc",
        -9.884757958758378
      ],
      [
        "CCCS",
        -10.074901323848442
      ],
      [
        "▁NC",
        -10.174180411834037
      ],
      [
        "▁COCCN",
        -10.182867019690027
      ],
      [
        "▁COCCO",
        -10.210382702506402
      ],
      [
        "▁COCCC",
        -10.390960567106395
      ],
      [
        "OCO",
        -10.445584736697658
      ],
      [
        "COCC",
        -10.469925833149428
      ],
      [
        "▁CCOCCN",
        -10.487938027145828
      ],
      [
        "SC",
        -10.868655865451124
      ],
      [
        "co",
        -11.175046369147724
      ],
      [
        "I",
        -11.188088269693656
      ],
      [
        "on",
        -11.199838029113598
      ],
      [
        "CCCCN",
        -11.27383588160196
      ],
      [
        "▁CCCCN",
        -11.694782342260607
      ],
      [
        "CCOCCN",
        -11.987604176139255
      ],
      [
        "B",
        -12.313357692926305
      ],
      [
        "r",
        -12.313457692926304
      ],
      [
        "CCCCO",
        -12.313457692926304
      ]
    ]
  }
}