{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Nmt"
      },
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Metaspace",
        "replacement": "▁",
        "add_prefix_space": true
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 2,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "▁",
        -0.6931471811208318
      ],
      [
        "c",
        -2.220290809829148
      ],
      [
        "C",
        -2.2673690803860964
      ],
      [
        "(",
        -2.9981361170080127
      ],
      [
        ")",
        -2.9981361170080127
      ],
      [
        "1",
        -3.4844890198102156
      ],
      [
        "O",
        -3.5511292076377536
      ],
      [
        "2",
        -3.863252526882995
      ],
      [
        "N",
        -3.954480326557153
      ],
      [
        "=",
        -3.9639438163153393
      ],
      [
        "n",
        -4.49249510621453
      ],
      [
        "3",
        -4.706416340241001
      ],
      [
        "[",
        -4.861383518381034
      ],
      [
        "]",
        -4.861383518381034
      ],
      [
        "H",
        -5.301586812349004
      ],
      [
        "+",
        -5.3673934007416815
      ],
      [
        "F",
        -5.4124559289081144
      ],
      [
        "-",
        -5.423110161151882
      ],
      [
        "S",
        -5.8215121558686835
      ],
      [
        "4",
        -5.9380633677755785
      ],
      [
        "l",
        -5.992632624740358
      ],
      [
        "s",
        -6.538637721159365
      ],
      [
        "B",
        -6.863075351404065
      ],
      [
        "o",
        -6.897179397445873
      ],
      [
        "r",
        -6.910694347401536
      ],
      [
        "5",
        -7.123649658940504
      ],
      [
        "#",
        -7.147919182580168
      ],
      [
        "6",
        -8.065038575838681
      ],
      [
        "i",
        -8.687375580014221
      ],
      [
        "P",
        -8.71389638203985
      ],
      [
        "I",
        -8.797484341222447
      ],
      [
        "7",
        -8.856288399584308
      ],
      [
        "8",
        -9.60822991649292
      ],
      [
        "%",
        -9.830908073412212
      ],
      [
        "9",
        -10.315614217995469
      ],
      [
        "0",
        -10.929791641751478
      ],
      [
        "e",
        -11.284192796317075
      ],
      [
        "A",
        -12.579082839534651
      ],
      [
        "p",
        -13.066934980384708
      ],
      [
        "G",
        -13.257515536986528
      ],
      [
        "T",
        -13.400122608746443
      ],
      [
        "b",
        -14.060850205484396
      ],
      [
        "g",
        -14.0738373987575
      ],
      [
        "W",
        -14.763359812563314
      ],
      [
        "a",
        -15.212454252958995
      ],
      [
        "t",
        -15.41262074816509
      ],
      [
        "R",
        -15.55529509363809
      ],
      [
        "u",
        -15.62132543499004
      ],
      [
        "V",
        -16.125344933044865
      ],
      [
        "M",
        -16.324758316156874
      ],
      [
        "Z",
        -16.522364723441015
      ],
      [
        "h",
        -17.331148753511044
      ],
      [
        "d",
        -17.867339476497104
      ],
      [
        "X",
        -17.93400614316378
      ],
      [
        "U",
        -18.08235779151549
      ],
      [
        "Y",
        -18.165691124848927
      ],
      [
        "f",
        -18.165691124848927
      ],
      [
        "K",
        -18.592711326881748
      ],
      [
        "L",
        -18.735568469778855
      ],
      [
        "E",
        -18.90223513644552
      ],
      [
        "m",
        -18.90223513644552
      ],
      [
        "D",
        -21.185568469778858
      ],
      [
        "y",
        -21.185568469778858
      ]
    ]
  }
}