{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Nmt"
      },
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Metaspace",
        "replacement": "▁",
        "add_prefix_space": true
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 2,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "c",
        -1.1386887346647274
      ],
      [
        ")",
        -2.22188308086427
      ],
      [
        "(",
        -2.22188308086427
      ],
      [
        "1",
        -2.689796217656463
      ],
      [
        "n",
        -2.847223433472303
      ],
      [
        "o",
        -2.863615893723029
      ],
      [
        "2",
        -3.0495970201323317
      ],
      [
        "=",
        -3.1809884073467805
      ],
      [
        "3",
        -3.872636517163347
      ],
      [
        "[",
        -4.063502535220648
      ],
      [
        "]",
        -4.063502535220648
      ],
      [
        "cc",
        -4.329614694010362
      ],
      [
        "h",
        -4.527577302154281
      ],
      [
        "+",
        -4.56998646445265
      ],
      [
        "ccc",
        -4.574701008989907
      ],
      [
        "-",
        -4.586977156105774
      ],
      [
        "f",
        -4.706444528720429
      ],
      [
        "▁cc",
        -4.909917398786916
      ],
      [
        "s",
        -4.919565726311468
      ],
      [
        "▁",
        -4.980198494633564
      ],
      [
        "4",
        -5.163565499514186
      ],
      [
        "cccc",
        -5.260629343504888
      ],
      [
        "ccccc",
        -5.520580455414952
      ],
      [
        "l",
        -5.611763339302228
      ],
      [
        "▁coc",
        -5.776790470895088
      ],
      [
        "nc",
        -5.943688577328155
      ],
      [
        "5",
        -6.061503117772147
      ],
      [
        "br",
        -6.13932054763094
      ],
      [
        "▁c",
        -6.235681670691478
      ],
      [
        "#",
        -6.302176201292908
      ],
      [
        "cl",
        -6.352671191841217
      ],
      [
        "oc",
        -6.7091076985035984
      ],
      [
        "▁ccc",
        -6.832350176981011
      ],
      [
        "▁o",
        -6.875960287516637
      ],
      [
        "▁ccoc",
        -6.932782281147624
      ],
      [
        "i",
        -7.400726807245601
      ],
      [
        "sc",
        -7.470195519925823
      ],
      [
        "ccn",
        -7.611593484926692
      ],
      [
        "6",
        -7.737132462358352
      ],
      [
        "cn",
        -7.768338996009935
      ],
      [
        "nn",
        -7.832459111235909
      ],
      [
        "▁cn",
        -7.844274253399046
      ],
      [
        "coc",
        -7.863790880363666
      ],
      [
        "nnc",
        -7.926939813221965
      ],
      [
        "ncc",
        -7.941668701737505
      ],
      [
        "csc",
        -7.949885727705244
      ],
      [
        "occ",
        -8.067674403341393
      ],
      [
        "ns",
        -8.206396220243075
      ],
      [
        "p",
        -8.247716731031305
      ],
      [
        "ccoc",
        -8.24814695680019
      ],
      [
        "cnc",
        -8.252098240145827
      ],
      [
        "scc",
        -8.277687265196823
      ],
      [
        "▁cs",
        -8.299230810444206
      ],
      [
        "cs",
        -8.381914604491232
      ],
      [
        "▁cccc",
        -8.420198528695416
      ],
      [
        "▁ccn",
        -8.42074364531488
      ],
      [
        "ccs",
        -8.456492926808417
      ],
      [
        "cccn",
        -8.480177908746075
      ],
      [
        "▁n",
        -8.492539311624178
      ],
      [
        "ccnc",
        -8.578991051346271
      ],
      [
        "▁cccn",
        -8.679507968009778
      ],
      [
        "ccocc",
        -8.84822545536048
      ],
      [
        "7",
        -8.89335165171854
      ],
      [
        "occoccoccoccocc",
        -8.998497489057797
      ],
      [
        "co",
        -9.079865143920143
      ],
      [
        "▁ccs",
        -9.129578089583008
      ],
      [
        "cco",
        -9.139650662323524
      ],
      [
        "▁clc",
        -9.20567506580577
      ],
      [
        "8",
        -9.34335165171854
      ],
      [
        "▁cocc",
        -9.39970146145738
      ],
      [
        "▁ccccc",
        -9.51619966551175
      ],
      [
        "ccsc",
        -9.554703988606748
      ],
      [
        "▁cccccccccc",
        -9.602737902476102
      ],
      [
        "b",
        -9.633581465177247
      ],
      [
        "occo",
        -9.664958549727746
      ],
      [
        "e",
        -9.676684985051873
      ],
      [
        "▁cccoc",
        -9.6981564118587
      ],
      [
        "ccco",
        -9.748704958993043
      ],
      [
        "coccoccoccoccocc",
        -9.87207194057414
      ],
      [
        "cocc",
        -10.020997618548815
      ],
      [
        "▁ccccn",
        -10.046251836360328
      ],
      [
        "▁ccccccc",
        -10.069603513154949
      ],
      [
        "▁ccccoc",
        -10.071429281077643
      ],
      [
        "▁csc",
        -10.119923130559364
      ],
      [
        "ncn",
        -10.125625794680236
      ],
      [
        "cns",
        -10.197223344664062
      ],
      [
        "snn",
        -10.32771633970811
      ],
      [
        "nnn",
        -10.440686241914484
      ],
      [
        "nccn",
        -10.545305714482176
      ],
      [
        "noc",
        -10.563244482701895
      ],
      [
        "occoc",
        -10.701981649330468
      ],
      [
        "cnn",
        -10.732322707801254
      ],
      [
        "nccc",
        -10.991024173399127
      ],
      [
        "▁cccccc",
        -11.030644032858604
      ],
      [
        "▁cccccccccccc",
        -11.112033105673376
      ],
      [
        "cccccc",
        -11.17529176511825
      ],
      [
        "a",
        -11.176684985051873
      ],
      [
        "ccccccccc",
        -11.207671474163428
      ],
      [
        "▁ccccccccc",
        -11.249686508441442
      ],
      [
        "cccccccccccccc",
        -11.2568065172425
      ],
      [
        "cscc",
        -11.294279170994638
      ],
      [
        "ccccccccccccccc",
        -11.298203016665555
      ],
      [
        "▁b",
        -11.3765131691417
      ],
      [
        "▁cccccccc",
        -11.419189820958948
      ],
      [
        "sccc",
        -11.424974072503142
      ],
      [
        "cccoc",
        -11.50864318820262
      ],
      [
        "ccccccccccc",
        -11.563812838763765
      ],
      [
        "ccccn",
        -11.621026059609964
      ],
      [
        "occoccoc",
        -11.780429218473422
      ],
      [
        "r",
        -12.55282306484243
      ],
      [
        "ccocco",
        -12.55282306484243
      ]
    ]
  }
}