{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Nmt"
      },
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Metaspace",
        "replacement": "▁",
        "add_prefix_space": true
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 2,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "c",
        -1.8325501267458328
      ],
      [
        "C",
        -2.085833731170693
      ],
      [
        ")",
        -2.1794139187786303
      ],
      [
        "(",
        -2.1794139187786303
      ],
      [
        "1",
        -2.6473270555708233
      ],
      [
        "O",
        -2.908316332235934
      ],
      [
        "2",
        -3.007127858046692
      ],
      [
        "=",
        -3.138519245261141
      ],
      [
        "N",
        -3.3313758037317305
      ],
      [
        "3",
        -3.830167355077707
      ],
      [
        "[",
        -4.021033373135008
      ],
      [
        "]",
        -4.021033373135008
      ],
      [
        "n",
        -4.2774422528925875
      ],
      [
        "ccc",
        -4.4391790758440415
      ],
      [
        "H",
        -4.4851081400686414
      ],
      [
        "+",
        -4.52751730236701
      ],
      [
        "-",
        -4.544507994020134
      ],
      [
        "CC",
        -4.607523195934229
      ],
      [
        "cccc",
        -4.666119693433614
      ],
      [
        "F",
        -4.670620867963353
      ],
      [
        "4",
        -5.121096337428546
      ],
      [
        "▁C",
        -5.163538144660347
      ],
      [
        "▁CC",
        -5.186433194987644
      ],
      [
        "S",
        -5.240923034028698
      ],
      [
        "cc",
        -5.297230130780081
      ],
      [
        "CCC",
        -5.398382240870885
      ],
      [
        "▁",
        -5.479601908139958
      ],
      [
        "Cl",
        -5.516677182880244
      ],
      [
        "NC",
        -5.7720798621463425
      ],
      [
        "5",
        -6.019033955686507
      ],
      [
        "CCCC",
        -6.091218058928985
      ],
      [
        "Br",
        -6.096851374684951
      ],
      [
        "▁CO",
        -6.1226121436428524
      ],
      [
        "nc",
        -6.189770897333768
      ],
      [
        "OC",
        -6.253272290547392
      ],
      [
        "#",
        -6.259707039207268
      ],
      [
        "l",
        -6.417912554625041
      ],
      [
        "▁O",
        -6.467668724107586
      ],
      [
        "s",
        -6.547807068455773
      ],
      [
        "▁CCC",
        -6.602039316796626
      ],
      [
        "CCN",
        -6.674074883113082
      ],
      [
        "o",
        -6.692188164566057
      ],
      [
        "nnc",
        -6.971819763184997
      ],
      [
        "nn",
        -7.0872976248625665
      ],
      [
        "CCCCC",
        -7.19300639125257
      ],
      [
        "no",
        -7.276252813956157
      ],
      [
        "▁COC",
        -7.329033247669198
      ],
      [
        "NCC",
        -7.3764529490665
      ],
      [
        "CCOCC",
        -7.458908285977032
      ],
      [
        "ncn",
        -7.4840036438888
      ],
      [
        "▁N",
        -7.486276057964792
      ],
      [
        "▁CCOC",
        -7.499290910945031
      ],
      [
        "▁CN",
        -7.513425929350326
      ],
      [
        "OCC",
        -7.516116036082575
      ],
      [
        "sc",
        -7.583828971249213
      ],
      [
        "cnc",
        -7.58506199500868
      ],
      [
        "ncc",
        -7.634890007798664
      ],
      [
        "i",
        -7.694663300272712
      ],
      [
        "6",
        -7.694663300272712
      ],
      [
        "oc",
        -7.72564267417347
      ],
      [
        "ccnc",
        -7.762658264172304
      ],
      [
        "CO",
        -7.82228799477094
      ],
      [
        "CCCN",
        -7.87172541383787
      ],
      [
        "cccn",
        -7.875369198920738
      ],
      [
        "▁CCCC",
        -7.9568764188470436
      ],
      [
        "SC",
        -8.002337294122121
      ],
      [
        "COC",
        -8.010403671108062
      ],
      [
        "▁CCO",
        -8.0154211326615
      ],
      [
        "▁CS",
        -8.018832409844851
      ],
      [
        "SCC",
        -8.022823157712043
      ],
      [
        "CN",
        -8.03934617165531
      ],
      [
        "cn",
        -8.070918475660292
      ],
      [
        "CCS",
        -8.112916095350831
      ],
      [
        "csc",
        -8.148597619230532
      ],
      [
        "CS",
        -8.16108200458106
      ],
      [
        "cnn",
        -8.163475617837227
      ],
      [
        "ccs",
        -8.186959804241676
      ],
      [
        "cco",
        -8.198048368242024
      ],
      [
        "▁CCN",
        -8.217144700567495
      ],
      [
        "P",
        -8.305247568946438
      ],
      [
        "ccn",
        -8.322699921731036
      ],
      [
        "CCOC",
        -8.345115301049947
      ],
      [
        "▁COCC",
        -8.355816885941765
      ],
      [
        "CNC",
        -8.37242461576646
      ],
      [
        "CCO",
        -8.44167784622474
      ],
      [
        "▁CCCCC",
        -8.571159375939569
      ],
      [
        "cs",
        -8.66327559789252
      ],
      [
        "I",
        -8.684215822966232
      ],
      [
        "▁CCCN",
        -8.774610381897997
      ],
      [
        "7",
        -8.850882489632898
      ],
      [
        "▁CCS",
        -8.89157844887687
      ],
      [
        "CCCO",
        -8.925245618002187
      ],
      [
        "CCCCCC",
        -9.014693669780256
      ],
      [
        "cncc",
        -9.032140774783391
      ],
      [
        "OCCOCCOCCOCCOCC",
        -9.079049364909892
      ],
      [
        "OCCO",
        -9.119198365882852
      ],
      [
        "CSC",
        -9.157256346123418
      ],
      [
        "CCCCCCCCC",
        -9.222531716633128
      ],
      [
        "nccc",
        -9.222653573940203
      ],
      [
        "nnn",
        -9.248991350115892
      ],
      [
        "on",
        -9.276583689709438
      ],
      [
        "8",
        -9.3008824896329
      ],
      [
        "▁CCCCCCC",
        -9.376036782967104
      ],
      [
        "▁Cl",
        -9.37890788780132
      ],
      [
        "scc",
        -9.42683337318626
      ],
      [
        "OCCOC",
        -9.57046662697634
      ],
      [
        "COCCOCCOCCOCCOCC",
        -9.585839446612466
      ],
      [
        "B",
        -9.600822251371683
      ],
      [
        "CSCC",
        -9.607047371907184
      ],
      [
        "COCC",
        -9.630746851225965
      ],
      [
        "e",
        -9.634215822966231
      ],
      [
        "snn",
        -9.714126912203849
      ],
      [
        "CCCCCCCCCCC",
        -9.717323815455336
      ],
      [
        "▁NN",
        -9.723204995229974
      ],
      [
        "▁CCCCCC",
        -9.825838349839016
      ],
      [
        "▁CCCCCCCC",
        -9.853389226361632
      ],
      [
        "CCCCCCCCCCCCCCC",
        -9.888738943788765
      ],
      [
        "▁CCCCN",
        -9.895811636494908
      ],
      [
        "▁F",
        -9.903579345293878
      ],
      [
        "▁CCCCCCCCCC",
        -9.941499077763138
      ],
      [
        "ncs",
        -10.064380400328757
      ],
      [
        "NCCC",
        -10.165294861198284
      ],
      [
        "CCCCO",
        -10.16683340025895
      ],
      [
        "CCCCCCCCCCCCCC",
        -10.239985156271684
      ],
      [
        "ns",
        -10.275063858872905
      ],
      [
        "CCCOC",
        -10.28264004775702
      ],
      [
        "▁CCCCCCCCCCO",
        -10.309135163189584
      ],
      [
        "CCSC",
        -10.363929816625884
      ],
      [
        "▁CCCCCCCCCCCC",
        -10.449414002442618
      ],
      [
        "▁CCCO",
        -10.514011634342326
      ],
      [
        "CCOCCO",
        -10.660929381560551
      ],
      [
        "NCCO",
        -10.70330380145751
      ],
      [
        "NN",
        -10.88116274154197
      ],
      [
        "CCCCCCCCCCCCCCCC",
        -11.10010095437038
      ],
      [
        "p",
        -11.134215822966231
      ],
      [
        "A",
        -11.134215822966231
      ],
      [
        "▁CCCCO",
        -11.220586422056538
      ],
      [
        "▁B",
        -11.28506142857012
      ],
      [
        "▁CCOCCC",
        -11.381007318132898
      ],
      [
        "▁CCCCCCCCC",
        -11.411054550676134
      ],
      [
        "OCCC",
        -11.52021081775792
      ],
      [
        "▁CCCCOC",
        -11.547962564626248
      ],
      [
        "CCCCCCC",
        -11.54852100865634
      ],
      [
        "OCCOCCO",
        -11.77466954306638
      ],
      [
        "▁OCC",
        -12.05009241133406
      ],
      [
        "co",
        -12.244728966155286
      ],
      [
        "CCCCCCCC",
        -12.371631208405836
      ],
      [
        "r",
        -12.414896596223558
      ],
      [
        "occ",
        -12.414896596223558
      ]
    ]
  }
}