#version: 0.2 - Trained by `huggingface/tokenizers`
c c
C C
cc c
( =
] (
@ @
C c
cc ccc
CC C
n c
N C
N H
+ ]
) [
C O
cc cc
n H
CC N
CC O
C l
N c
C N
) (
( -
O C
CO c
CC CC
+ ](
( [
) (=
CC c
n n
- ]
s c
C NC
n cc
) =
N Cc
n nc
CCC N
B r
o c
CO C
S c
CC CCC
CCO C
CCO CC
C n
1 2
c n
+] [
-] )
CCO c
2 1
O c
]( [
O CC
c nc
N CC
ccc s
CCC O
ccc nc
C Sc
CC n
CC NC
ccc o
c nn
+] )
3 2
cccc n
n o
2 3
n oc
c sc
c s
@ ]
cc nc
CC Cc
@@ ]
O Cc
ccc n
cc n
cc ncc
S CC
cc sc
N CCc
N S
@ ](
@@ ](
N CCC
C Nc
CCC NC
O CO
CCCC CC
ncc n
nc nc
O CCO
CCC n
n cccc
CC CCN
nc n
o n
CO CC
CCC Oc
C S
s ccc
ncc s
S Cc
CO CCN
( /
-] )[
CO Cc
c ncc
cnc n
nn nn
S C
CC Sc
)( [
3 4
= [
n ccc
F c
CN Cc
n cccn
N CCN
+]( [
CN S
cc oc
cc nn
CC S
4 3
O CCC
CCN c
Cl c
c nccn
+] =
+] )[
nn n
-] )=
c oc
CCC OC
CCCC NC
nnc n
CC CCO
c nnc
CCCC n
( \
) /
nn nc
nc nn
CCN S
CC CCOc
O CCN
NCC NC
CO CCn
O CCCO
(\ [
cnn n
NCC Cc
CCCC c
F C
o ccc
CO CCNC
CO CCOc
N CCCC
CCC S
N CCCN
N CCOc
o nc
ncc nc
NCCC n
)= [
NCC n
CCCC CCC
csc n
cs cc
1 3
+] )(
n sc
CCC Nc
O CCc
OCC n
@@] (=
cn ccc
CCN CC
Br c
CCO Cc
CO CCCNC
CCCCC NC
CO CCC
CO CCO
cc on
s cc
@] (=
CC CCCN
NCCC OC
CCC Sc
O CCCC
sc nc
nc sc
N n
CCN Cc
no nc
O CCCn
CN CC
nnc s
CCO CCN
S CCC
s ccn
(= [
@ ]([
OCC NC
CO CCc
] /
c o
nc oc
CO CCCN
O CCCCn
CC CCOC
N CCO
O CCOc
NCCN c
cnc nc
/ [
oc nc
O CCOC
) -
CCCCC Oc
3 1
ccc nn
n s
OCC Cc
CCCC S
nn sc
CCC OCC
CCO CCCNC
N CCCO
CCOCC NC
N CCOC
4 5
@@ ]([
N CCCCn
N N
NCC S
CO CCOC
CCO CCC
s nc
CN CCc
CCO CCOc
cc s
O S
-] /
CO CCCn
CCCC CCOc
CN CCO
O CCNc
]( /
O CCCNC
\ [
N CCOCC
cs nn
2 4
CCCN S
NCCC NC
NCC Sc
CCC NCc
NCCC OCC
CCO CCCC
CN CCN
CO CCCC
ccnc n
CCCC CCNC
CCO CCO
CCOCC n
5 4
nc on
N CCCCC
+] )([
CCCC Cc
CCCCC n
O CCCN
nn cc
-] )(=
CCCC Sc
o cc
-] [
CO CCCOc
NCCCC Cc
ncc o
NCCN S
cc no
OCC Sc
cnc s
nnc o
COCCN c
NCCC Oc
NCC CCN
CO CCOCC
-] )(
CCCO CCN
nc ncc
S CCOc
s nnc
4 2
CO CCCOCCN
CN CCC
CCCCN c
O COC
+] /
OCC S
S CCN
NCCC Sc
CCCO Cc
+] \
S CCCC
CO CO
CN CCOC
CCCN CC
cn oc
) \
)( /
CCO CCOCc
] [
O CCOCC
NCCC Nc
CO CCCOC
CN N
(/ [
N CCCCCC
CCCC CCn
S CCNC
COCCN Cc
S CCc
CCCC CCN
CCO CCOC
CCCCC O
COCCN CC
O CN
CC CCOCC
cnc o
CCCCC OC
NC N
CO CCOCCNC
N CCOCc
CCO CCCn
O CCCCC
OCCC OC
CCO CCCN
COCCN S
O CCCOc
cnn s
COCC Sc
CCCCN S
I c
o ncc
+] (=
CCCCO CCCNC
NCCCO Cc
CO CCCCCNC
CO CCCNc
CN n
CCCC CCCC
CO COc
COCCO CCN
CCCC CCc
NCC CCNc
OC n
NCC CCOc
COCC S
S CCCc
S CCn
CO CCCCC
NCCC S
cc nnc
COCCC OCC
CCCC CCO
CC CCOCCNC
NN N
CCC F
CO CCCCN
CCCC CCOC
CCCO CCc
NCCN Cc
O CCNS
OCCC Nc
)/ [
NCCCO CCc
CCCC CCCCCCC
OCCC Sc
S CCOC
S CCO
CCCCC Sc
CO n
NCCCN S
CN CCOc
3 5
N CCCCc
CCCCC S
CN CCn
NCCO CCO
OCCN Cc
CO CCCS
S CCCOc
CCO CCCNc
CCCC CCCCCC
CCCO CCOC
CCCCC OCC
CCCCO CCN
COCCO CCCNC
CN CCNC
NCCCC CCC
CCCCC Nc
S CCCO
NCC CCOCc
CCCCCC Sc
CCO CCc
OCC CCN
]/ [
n scc
-] )([
CO CCCc
CN CCCN
s n
O CCCCCC
Cl C
CCCCO CCO
OCCO CCN
CN CCCn
COCCO CCCC
OCC F
O CCCCNC
S CCCn
CCOCC Sc
CCCC CCNc
c onc
CCCC CCCCC
COCCCN S
CCCCN Cc
CCO CCOCC
CN CCCC
CO CCOCc
CN CCCOC
CO CCCCNC
CCCO CCO
CCO CCCOC
SCC Sc
OCCO Cc
cn sc
-]) /
CCOCC S
CCCC CCOCC
( #
CCOCC Cc
]( /[
-])= [
CCO CCCNS
CCCCCN S
NCCCC CCNC
COCCO CCC
CS C
CCCCO CCC
OCCO CCOc
CCCCO CCOC
CCCCO Cc
SCC S
CCN CCN
CCCC CCNS
S Cn
S CCNS
5 6
CN CCCc
C H
OCC CCOc
CCO CO
+] /[
CN CCS
COCCC Sc
C F
5 3
CO CCCCNc
CN CCSc
12 3
NC n
NCCC F
no cc
NCCO CCc
s s
CCCO CCC
COCCO CCCCNC
S CCCNC
NCCO CCC
S CCCCC
1 4
COCCOCC Sc
CCN CCC
CCC OCCNC
COCC CCOC
CCO CCCCNC
OCCC NCc
CCCCO CCOc
S CCOCCO
CCCCO CCOCc
CO CCCO
CCCCN CC
CCO CCNc
O CCCCc
NCCC NCc
S CCNc
COCCC NCc
nn ccc
O CCCNS
S CCCCCO
NCCO CCOC
s ncc
OCCO CCC
nc no
CC F
O n
CCCO CCOCC
NCC CCO
CCCCO CCOCC
NCCCCC OC
OCCCC Sc
CN CCCOCC
COCC CCCN
6 5
CCN CCOC
NN NN
COC n
ncn s
OCCO CCO
CN CCCO
s sc
CCCO CCOc
@@]( /
O CCOCCn
CC CCOCCn
@]( /
COCCCN CC
OCCC OCC
CN CCOCC
S CCCCCn
N CCCCNC
CCCCCCCC CCCC
CCO CCNCc
OCC CCNc
CCN CCc
COCCCC Sc
CCO CN
CCCCO CCCN
cccc cc
CCCCO CCOCCNC
+]) /
CCOCCO CCOCCO
COCC CCOc
CN CCNc
NCC CCOC
N O
CN CCCNc
COCCO CCOC
NCCCC CCCCNC
COCCO CCNc
NCC CCOCCc
S CCOCC
S CCCN
4 1
CN CCCCN
CN CCNS
OCC CCO
CCN CCOc
(- [
OCCOCC Sc
O COc
+] \[
OCCC S
N NC
SCC CCO
OCCCC CCN
CCO CCCOc
S CCCOC
CN CCCOc
CCOCCC NCc
CO CCCCn
coc n
COCCO CCNS
cs nc
S CCCSc
CCCC CCCNC
OCCN CC
COCCOCC S
ccn s
NCCCCC O
+]( /
CCCCO CCNc
- ](
CCN CCNC
CN CCCCn
S CCCS
S CCNCc
CCN CCn
S N
CN CCCSc
COCCO CCCN
CO COC
Br C
OCC CCCN
CN CCOCc
CCCCC OCc
+] )=
CO CCOCCn
COCC CCCNS
CCO COc
OCCCCC Sc
CCCCO CCCNc
O H
COCCCCC Nc
CCO CCNS
CCOC n
CCCCOCCO CCNc
NCC F
COCCN CCc
NCCCO CCOC
CNCCO CCO
CCN CCO
N Sc
O CCCCCn
COCCN CCN
CO CN
COCCO CCOc
+] =[
SCCC OCC
CO CCCCS
CCOCC CCOC
CCCCOCC Sc
S CCOCCOc
OCCO CCNc
CO CCCCCC
+] #
F CCC
O CCCCCO
OCCO CCOC
CCCCO CCCNS
NC O
CN CCCNC
-] =[
CCCN CCN
CCOC S
S CSc
OCCCC CCn
OCC CCOC
OCCOCC Cc
-]) \
NCCN CC
CCN CCS
S CCOCCC
COCCO CCCNCc
CCN n
CCCC CCOCc
CCCN CCOC
F CCCN
NC Nc
4 6
S CCCNS
CCO CCOCCC
sc nn
CCOCCO CCOC
# [
N CCOCCN
NC NC
CCN CCSc
CCCN CCC
CCCN CCOc
SCC CCOc
nnn s
N OC
O CCOCCNC
NCC CCCN
CO CCCCCOC
NCCN CCc
CCCCO CCCC
31 4
S CCCCCC
NC NS
CCCC CCCc
+]( -
CCCCOCC S
COC Sc
cn on
CCCO CCCC
COCCO CCCNc
O CCCCCOc
CCO n
CN CCCCNc
SCC CCOC
s snc
CO CCCCc
CCCO CCOCc
S CCCNc
CCCC CCCO
CCCCC NCc
OCCO CCNCC
OCCCO CCc
COCCOCC CCNc
1 5
S CCOCCOC
CCN CCCOC
CCCCC F
CCOCC CCN
CCOCCO CCO
CCCCO CCCn
OCCCC CCOc
co cc
CC SC
CCCCO CCNCc
NCCCC CCO
CCN CCNCc
S CCCCSc
CN CCCCC
CCCCCC CCO
COCCN CCNc
OCCC F
CCCO CCCNC
COCCCN CCNc
C Br
N CCCCCNC
NC S
CCCCCC S
OCCCC CCOC
6 4
F CC
CCCN CCn
OCCO CCOCCO
COCCO CCNCc
] )
NC Sc
CCO CCCSc
CCCC CCCCc
CCOC Sc
CCCN CCS
