{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[UNK]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "cc": 261,
      "CC": 262,
      "ccc": 263,
      "(=": 264,
      "](": 265,
      "@@": 266,
      "Cc": 267,
      "ccccc": 268,
      "CCC": 269,
      "nc": 270,
      "NC": 271,
      "NH": 272,
      "+]": 273,
      ")[": 274,
      "CO": 275,
      "cccc": 276,
      "nH": 277,
      "CCN": 278,
      "CCO": 279,
      "Cl": 280,
      "Nc": 281,
      "CN": 282,
      ")(": 283,
      "(-": 284,
      "OC": 285,
      "COc": 286,
      "CCCC": 287,
      "+](": 288,
      "([": 289,
      ")(=": 290,
      "CCc": 291,
      "nn": 292,
      "-]": 293,
      "sc": 294,
      "CNC": 295,
      "ncc": 296,
      ")=": 297,
      "NCc": 298,
      "nnc": 299,
      "CCCN": 300,
      "Br": 301,
      "oc": 302,
      "COC": 303,
      "Sc": 304,
      "CCCCC": 305,
      "CCOC": 306,
      "CCOCC": 307,
      "Cn": 308,
      "12": 309,
      "cn": 310,
      "+][": 311,
      "-])": 312,
      "CCOc": 313,
      "21": 314,
      "Oc": 315,
      "]([": 316,
      "OCC": 317,
      "cnc": 318,
      "NCC": 319,
      "cccs": 320,
      "CCCO": 321,
      "cccnc": 322,
      "CSc": 323,
      "CCn": 324,
      "CCNC": 325,
      "ccco": 326,
      "cnn": 327,
      "+])": 328,
      "32": 329,
      "ccccn": 330,
      "no": 331,
      "23": 332,
      "noc": 333,
      "csc": 334,
      "cs": 335,
      "@]": 336,
      "ccnc": 337,
      "CCCc": 338,
      "@@]": 339,
      "OCc": 340,
      "cccn": 341,
      "ccn": 342,
      "ccncc": 343,
      "SCC": 344,
      "ccsc": 345,
      "NCCc": 346,
      "NS": 347,
      "@](": 348,
      "@@](": 349,
      "NCCC": 350,
      "CNc": 351,
      "CCCNC": 352,
      "OCO": 353,
      "CCCCCC": 354,
      "nccn": 355,
      "ncnc": 356,
      "OCCO": 357,
      "CCCn": 358,
      "ncccc": 359,
      "CCCCN": 360,
      "ncn": 361,
      "on": 362,
      "COCC": 363,
      "CCCOc": 364,
      "CS": 365,
      "sccc": 366,
      "nccs": 367,
      "SCc": 368,
      "COCCN": 369,
      "(/": 370,
      "-])[": 371,
      "COCc": 372,
      "cncc": 373,
      "cncn": 374,
      "nnnn": 375,
      "SC": 376,
      "CCSc": 377,
      ")([": 378,
      "34": 379,
      "=[": 380,
      "nccc": 381,
      "Fc": 382,
      "CNCc": 383,
      "ncccn": 384,
      "NCCN": 385,
      "+]([": 386,
      "CNS": 387,
      "ccoc": 388,
      "ccnn": 389,
      "CCS": 390,
      "43": 391,
      "OCCC": 392,
      "CCNc": 393,
      "Clc": 394,
      "cnccn": 395,
      "+]=": 396,
      "+])[": 397,
      "nnn": 398,
      "-])=": 399,
      "coc": 400,
      "CCCOC": 401,
      "CCCCNC": 402,
      "nncn": 403,
      "CCCCO": 404,
      "cnnc": 405,
      "CCCCn": 406,
      "(\\": 407,
      ")/": 408,
      "nnnc": 409,
      "ncnn": 410,
      "CCNS": 411,
      "CCCCOc": 412,
      "OCCN": 413,
      "NCCNC": 414,
      "COCCn": 415,
      "OCCCO": 416,
      "(\\[": 417,
      "cnnn": 418,
      "NCCCc": 419,
      "CCCCc": 420,
      "FC": 421,
      "occc": 422,
      "COCCNC": 423,
      "COCCOc": 424,
      "NCCCC": 425,
      "CCCS": 426,
      "NCCCN": 427,
      "NCCOc": 428,
      "onc": 429,
      "nccnc": 430,
      "NCCCn": 431,
      ")=[": 432,
      "NCCn": 433,
      "CCCCCCC": 434,
      "cscn": 435,
      "cscc": 436,
      "13": 437,
      "+])(": 438,
      "nsc": 439,
      "CCCNc": 440,
      "OCCc": 441,
      "OCCn": 442,
      "@@](=": 443,
      "cnccc": 444,
      "CCNCC": 445,
      "Brc": 446,
      "CCOCc": 447,
      "COCCCNC": 448,
      "CCCCCNC": 449,
      "COCCC": 450,
      "COCCO": 451,
      "ccon": 452,
      "scc": 453,
      "@](=": 454,
      "CCCCCN": 455,
      "NCCCOC": 456,
      "CCCSc": 457,
      "OCCCC": 458,
      "scnc": 459,
      "ncsc": 460,
      "Nn": 461,
      "CCNCc": 462,
      "nonc": 463,
      "OCCCn": 464,
      "CNCC": 465,
      "nncs": 466,
      "CCOCCN": 467,
      "SCCC": 468,
      "sccn": 469,
      "(=[": 470,
      "@]([": 471,
      "OCCNC": 472,
      "COCCc": 473,
      "]/": 474,
      "co": 475,
      "ncoc": 476,
      "COCCCN": 477,
      "OCCCCn": 478,
      "CCCCOC": 479,
      "NCCO": 480,
      "OCCOc": 481,
      "NCCNc": 482,
      "cncnc": 483,
      "/[": 484,
      "ocnc": 485,
      "OCCOC": 486,
      ")-": 487,
      "CCCCCOc": 488,
      "31": 489,
      "cccnn": 490,
      "ns": 491,
      "OCCCc": 492,
      "CCCCS": 493,
      "nnsc": 494,
      "CCCOCC": 495,
      "CCOCCCNC": 496,
      "NCCCO": 497,
      "CCOCCNC": 498,
      "NCCOC": 499,
      "45": 500,
      "@@]([": 501,
      "NCCCCn": 502,
      "NN": 503,
      "NCCS": 504,
      "COCCOC": 505,
      "CCOCCC": 506,
      "snc": 507,
      "CNCCc": 508,
      "CCOCCOc": 509,
      "ccs": 510,
      "OS": 511,
      "-]/": 512,
      "COCCCn": 513,
      "CCCCCCOc": 514,
      "CNCCO": 515,
      "OCCNc": 516,
      "](/": 517,
      "OCCCNC": 518,
      "\\[": 519,
      "NCCOCC": 520,
      "csnn": 521,
      "24": 522,
      "CCCNS": 523,
      "NCCCNC": 524,
      "NCCSc": 525,
      "CCCNCc": 526,
      "NCCCOCC": 527,
      "CCOCCCC": 528,
      "CNCCN": 529,
      "COCCCC": 530,
      "ccncn": 531,
      "CCCCCCNC": 532,
      "CCOCCO": 533,
      "CCOCCn": 534,
      "54": 535,
      "ncon": 536,
      "NCCCCC": 537,
      "+])([": 538,
      "CCCCCc": 539,
      "CCCCCn": 540,
      "OCCCN": 541,
      "nncc": 542,
      "-])(=": 543,
      "CCCCSc": 544,
      "occ": 545,
      "-][": 546,
      "COCCCOc": 547,
      "NCCCCCc": 548,
      "ncco": 549,
      "NCCNS": 550,
      "ccno": 551,
      "OCCSc": 552,
      "cncs": 553,
      "nnco": 554,
      "COCCNc": 555,
      "NCCCOc": 556,
      "NCCCCN": 557,
      "COCCOCC": 558,
      "-])(": 559,
      "CCCOCCN": 560,
      "ncncc": 561,
      "SCCOc": 562,
      "snnc": 563,
      "42": 564,
      "COCCCOCCN": 565,
      "CNCCC": 566,
      "CCCCNc": 567,
      "OCOC": 568,
      "+]/": 569,
      "OCCS": 570,
      "SCCN": 571,
      "NCCCSc": 572,
      "CCCOCc": 573,
      "+]\\": 574,
      "SCCCC": 575,
      "COCO": 576,
      "CNCCOC": 577,
      "CCCNCC": 578,
      "cnoc": 579,
      ")\\": 580,
      ")(/": 581,
      "CCOCCOCc": 582,
      "][": 583,
      "OCCOCC": 584,
      "NCCCNc": 585,
      "COCCCOC": 586,
      "CNN": 587,
      "(/[": 588,
      "NCCCCCC": 589,
      "CCCCCCn": 590,
      "SCCNC": 591,
      "COCCNCc": 592,
      "SCCc": 593,
      "CCCCCCN": 594,
      "CCOCCOC": 595,
      "CCCCCO": 596,
      "COCCNCC": 597,
      "OCN": 598,
      "CCCCOCC": 599,
      "cnco": 600,
      "CCCCCOC": 601,
      "NCN": 602,
      "COCCOCCNC": 603,
      "NCCOCc": 604,
      "CCOCCCn": 605,
      "OCCCCC": 606,
      "OCCCOC": 607,
      "CCOCCCN": 608,
      "COCCNS": 609,
      "OCCCOc": 610,
      "cnns": 611,
      "COCCSc": 612,
      "CCCCNS": 613,
      "Ic": 614,
      "oncc": 615,
      "+](=": 616,
      "CCCCOCCCNC": 617,
      "NCCCOCc": 618,
      "COCCCCCNC": 619,
      "COCCCNc": 620,
      "CNn": 621,
      "CCCCCCCC": 622,
      "COCOc": 623,
      "COCCOCCN": 624,
      "CCCCCCc": 625,
      "NCCCCNc": 626,
      "OCn": 627,
      "NCCCCOc": 628,
      "COCCS": 629,
      "SCCCc": 630,
      "SCCn": 631,
      "COCCCCC": 632,
      "NCCCS": 633,
      "ccnnc": 634,
      "COCCCOCC": 635,
      "CCCCCCO": 636,
      "CCCCOCCNC": 637,
      "NNN": 638,
      "CCCF": 639,
      "COCCCCN": 640,
      "CCCCCCOC": 641,
      "CCCOCCc": 642,
      "NCCNCc": 643,
      "OCCNS": 644,
      "OCCCNc": 645,
      ")/[": 646,
      "NCCCOCCc": 647,
      "CCCCCCCCCCC": 648,
      "OCCCSc": 649,
      "SCCOC": 650,
      "SCCO": 651,
      "CCCCCSc": 652,
      "COn": 653,
      "NCCCNS": 654,
      "CNCCOc": 655,
      "35": 656,
      "NCCCCc": 657,
      "CCCCCS": 658,
      "CNCCn": 659,
      "NCCOCCO": 660,
      "OCCNCc": 661,
      "COCCCS": 662,
      "SCCCOc": 663,
      "CCOCCCNc": 664,
      "CCCCCCCCCC": 665,
      "CCCOCCOC": 666,
      "CCCCCOCC": 667,
      "CCCCOCCN": 668,
      "COCCOCCCNC": 669,
      "CNCCNC": 670,
      "NCCCCCCC": 671,
      "CCCCCNc": 672,
      "SCCCO": 673,
      "NCCCCOCc": 674,
      "CCCCCCSc": 675,
      "CCOCCc": 676,
      "OCCCCN": 677,
      "]/[": 678,
      "nscc": 679,
      "-])([": 680,
      "COCCCc": 681,
      "CNCCCN": 682,
      "sn": 683,
      "OCCCCCC": 684,
      "ClC": 685,
      "CCCCOCCO": 686,
      "OCCOCCN": 687,
      "CNCCCn": 688,
      "COCCOCCCC": 689,
      "OCCF": 690,
      "OCCCCNC": 691,
      "SCCCn": 692,
      "CCOCCSc": 693,
      "CCCCCCNc": 694,
      "conc": 695,
      "CCCCCCCCC": 696,
      "COCCCNS": 697,
      "CCCCNCc": 698,
      "CCOCCOCC": 699,
      "CNCCCC": 700,
      "COCCOCc": 701,
      "CNCCCOC": 702,
      "COCCCCNC": 703,
      "CCCOCCO": 704,
      "CCOCCCOC": 705,
      "SCCSc": 706,
      "OCCOCc": 707,
      "cnsc": 708,
      "-])/": 709,
      "CCOCCS": 710,
      "CCCCCCOCC": 711,
      "(#": 712,
      "CCOCCCc": 713,
      "](/[": 714,
      "-])=[": 715,
      "CCOCCCNS": 716,
      "CCCCCNS": 717,
      "NCCCCCCNC": 718,
      "COCCOCCC": 719,
      "CSC": 720,
      "CCCCOCCC": 721,
      "OCCOCCOc": 722,
      "CCCCOCCOC": 723,
      "CCCCOCc": 724,
      "SCCS": 725,
      "CCNCCN": 726,
      "CCCCCCNS": 727,
      "SCn": 728,
      "SCCNS": 729,
      "56": 730,
      "CNCCCc": 731,
      "CH": 732,
      "OCCCCOc": 733,
      "CCOCO": 734,
      "+]/[": 735,
      "CNCCS": 736,
      "COCCCSc": 737,
      "CF": 738,
      "53": 739,
      "COCCCCNc": 740,
      "CNCCSc": 741,
      "123": 742,
      "NCn": 743,
      "NCCCF": 744,
      "nocc": 745,
      "NCCOCCc": 746,
      "ss": 747,
      "CCCOCCC": 748,
      "COCCOCCCCNC": 749,
      "SCCCNC": 750,
      "NCCOCCC": 751,
      "SCCCCC": 752,
      "14": 753,
      "COCCOCCSc": 754,
      "CCNCCC": 755,
      "CCCOCCNC": 756,
      "COCCCCOC": 757,
      "CCOCCCCNC": 758,
      "OCCCNCc": 759,
      "CCCCOCCOc": 760,
      "SCCOCCO": 761,
      "CCCCOCCOCc": 762,
      "COCCCO": 763,
      "CCCCNCC": 764,
      "CCOCCNc": 765,
      "OCCCCc": 766,
      "NCCCNCc": 767,
      "SCCNc": 768,
      "COCCCNCc": 769,
      "nnccc": 770,
      "OCCCNS": 771,
      "SCCCCCO": 772,
      "NCCOCCOC": 773,
      "sncc": 774,
      "OCCOCCC": 775,
      "ncno": 776,
      "CCF": 777,
      "On": 778,
      "CCCOCCOCC": 779,
      "NCCCCO": 780,
      "CCCCOCCOCC": 781,
      "NCCCCCOC": 782,
      "OCCCCSc": 783,
      "CNCCCOCC": 784,
      "COCCCCCN": 785,
      "65": 786,
      "CCNCCOC": 787,
      "NNNN": 788,
      "COCn": 789,
      "ncns": 790,
      "OCCOCCO": 791,
      "CNCCCO": 792,
      "ssc": 793,
      "CCCOCCOc": 794,
      "@@](/": 795,
      "OCCOCCn": 796,
      "CCCCOCCn": 797,
      "@](/": 798,
      "COCCCNCC": 799,
      "OCCCOCC": 800,
      "CNCCOCC": 801,
      "SCCCCCn": 802,
      "NCCCCNC": 803,
      "CCCCCCCCCCCC": 804,
      "CCOCCNCc": 805,
      "OCCCCNc": 806,
      "CCNCCc": 807,
      "COCCCCSc": 808,
      "CCOCN": 809,
      "CCCCOCCCN": 810,
      "cccccc": 811,
      "CCCCOCCOCCNC": 812,
      "+])/": 813,
      "CCOCCOCCOCCO": 814,
      "COCCCCOc": 815,
      "CNCCNc": 816,
      "NCCCCOC": 817,
      "NO": 818,
      "CNCCCNc": 819,
      "COCCOCCOC": 820,
      "NCCCCCCCCNC": 821,
      "COCCOCCNc": 822,
      "NCCCCOCCc": 823,
      "SCCOCC": 824,
      "SCCCN": 825,
      "41": 826,
      "CNCCCCN": 827,
      "CNCCNS": 828,
      "OCCCCO": 829,
      "CCNCCOc": 830,
      "(-[": 831,
      "OCCOCCSc": 832,
      "OCOc": 833,
      "+]\\[": 834,
      "OCCCS": 835,
      "NNC": 836,
      "SCCCCO": 837,
      "OCCCCCCN": 838,
      "CCOCCCOc": 839,
      "SCCCOC": 840,
      "CNCCCOc": 841,
      "CCOCCCNCc": 842,
      "COCCCCn": 843,
      "cocn": 844,
      "COCCOCCNS": 845,
      "csnc": 846,
      "SCCCSc": 847,
      "CCCCCCCNC": 848,
      "OCCNCC": 849,
      "COCCOCCS": 850,
      "ccns": 851,
      "NCCCCCO": 852,
      "+](/": 853,
      "CCCCOCCNc": 854,
      "-](": 855,
      "CCNCCNC": 856,
      "CNCCCCn": 857,
      "SCCCS": 858,
      "SCCNCc": 859,
      "CCNCCn": 860,
      "SN": 861,
      "CNCCCSc": 862,
      "COCCOCCCN": 863,
      "COCOC": 864,
      "BrC": 865,
      "OCCCCCN": 866,
      "CNCCOCc": 867,
      "CCCCCOCc": 868,
      "+])=": 869,
      "COCCOCCn": 870,
      "COCCCCCNS": 871,
      "CCOCOc": 872,
      "OCCCCCSc": 873,
      "CCCCOCCCNc": 874,
      "OH": 875,
      "COCCCCCNc": 876,
      "CCOCCNS": 877,
      "CCOCn": 878,
      "CCCCOCCOCCNc": 879,
      "NCCF": 880,
      "COCCNCCc": 881,
      "NCCCOCCOC": 882,
      "CNCCOCCO": 883,
      "CCNCCO": 884,
      "NSc": 885,
      "OCCCCCn": 886,
      "COCCNCCN": 887,
      "COCN": 888,
      "COCCOCCOc": 889,
      "+]=[": 890,
      "SCCCOCC": 891,
      "COCCCCS": 892,
      "CCOCCCCOC": 893,
      "CCCCOCCSc": 894,
      "SCCOCCOc": 895,
      "OCCOCCNc": 896,
      "COCCCCCC": 897,
      "+]#": 898,
      "FCCC": 899,
      "OCCCCCO": 900,
      "OCCOCCOC": 901,
      "CCCCOCCCNS": 902,
      "NCO": 903,
      "CNCCCNC": 904,
      "-]=[": 905,
      "CCCNCCN": 906,
      "CCOCS": 907,
      "SCSc": 908,
      "OCCCCCCn": 909,
      "OCCCCOC": 910,
      "OCCOCCCc": 911,
      "-])\\": 912,
      "NCCNCC": 913,
      "CCNCCS": 914,
      "SCCOCCC": 915,
      "COCCOCCCNCc": 916,
      "CCNn": 917,
      "CCCCCCOCc": 918,
      "CCCNCCOC": 919,
      "FCCCN": 920,
      "NCNc": 921,
      "46": 922,
      "SCCCNS": 923,
      "CCOCCOCCC": 924,
      "scnn": 925,
      "CCOCCOCCOC": 926,
      "#[": 927,
      "NCCOCCN": 928,
      "NCNC": 929,
      "CCNCCSc": 930,
      "CCCNCCC": 931,
      "CCCNCCOc": 932,
      "SCCCCOc": 933,
      "nnns": 934,
      "NOC": 935,
      "OCCOCCNC": 936,
      "NCCCCCN": 937,
      "COCCCCCOC": 938,
      "NCCNCCc": 939,
      "CCCCOCCCC": 940,
      "314": 941,
      "SCCCCCC": 942,
      "NCNS": 943,
      "CCCCCCCc": 944,
      "+](-": 945,
      "CCCCOCCS": 946,
      "COCSc": 947,
      "cnon": 948,
      "CCCOCCCC": 949,
      "COCCOCCCNc": 950,
      "OCCCCCOc": 951,
      "CCOn": 952,
      "CNCCCCNc": 953,
      "SCCCCOC": 954,
      "ssnc": 955,
      "COCCCCc": 956,
      "CCCOCCOCc": 957,
      "SCCCNc": 958,
      "CCCCCCCO": 959,
      "CCCCCNCc": 960,
      "OCCOCCNCC": 961,
      "OCCCOCCc": 962,
      "COCCOCCCCNc": 963,
      "15": 964,
      "SCCOCCOC": 965,
      "CCNCCCOC": 966,
      "CCCCCF": 967,
      "CCOCCCCN": 968,
      "CCOCCOCCO": 969,
      "CCCCOCCCn": 970,
      "OCCCCCCOc": 971,
      "cocc": 972,
      "CCSC": 973,
      "CCCCOCCNCc": 974,
      "NCCCCCCO": 975,
      "CCNCCNCc": 976,
      "SCCCCSc": 977,
      "CNCCCCC": 978,
      "CCCCCCCCO": 979,
      "COCCNCCNc": 980,
      "OCCCF": 981,
      "CCCOCCCNC": 982,
      "COCCCNCCNc": 983,
      "CBr": 984,
      "NCCCCCNC": 985,
      "NCS": 986,
      "CCCCCCS": 987,
      "OCCCCCCOC": 988,
      "64": 989,
      "FCC": 990,
      "CCCNCCn": 991,
      "OCCOCCOCCO": 992,
      "COCCOCCNCc": 993,
      "])": 994,
      "NCSc": 995,
      "CCOCCCSc": 996,
      "CCCCCCCCc": 997,
      "CCOCSc": 998,
      "CCCNCCS": 999
    },
    "merges": [
      "c c",
      "C C",
      "cc c",
      "( =",
      "] (",
      "@ @",
      "C c",
      "cc ccc",
      "CC C",
      "n c",
      "N C",
      "N H",
      "+ ]",
      ") [",
      "C O",
      "cc cc",
      "n H",
      "CC N",
      "CC O",
      "C l",
      "N c",
      "C N",
      ") (",
      "( -",
      "O C",
      "CO c",
      "CC CC",
      "+ ](",
      "( [",
      ") (=",
      "CC c",
      "n n",
      "- ]",
      "s c",
      "C NC",
      "n cc",
      ") =",
      "N Cc",
      "n nc",
      "CCC N",
      "B r",
      "o c",
      "CO C",
      "S c",
      "CC CCC",
      "CCO C",
      "CCO CC",
      "C n",
      "1 2",
      "c n",
      "+] [",
      "-] )",
      "CCO c",
      "2 1",
      "O c",
      "]( [",
      "O CC",
      "c nc",
      "N CC",
      "ccc s",
      "CCC O",
      "ccc nc",
      "C Sc",
      "CC n",
      "CC NC",
      "ccc o",
      "c nn",
      "+] )",
      "3 2",
      "cccc n",
      "n o",
      "2 3",
      "n oc",
      "c sc",
      "c s",
      "@ ]",
      "cc nc",
      "CC Cc",
      "@@ ]",
      "O Cc",
      "ccc n",
      "cc n",
      "cc ncc",
      "S CC",
      "cc sc",
      "N CCc",
      "N S",
      "@ ](",
      "@@ ](",
      "N CCC",
      "C Nc",
      "CCC NC",
      "O CO",
      "CCCC CC",
      "ncc n",
      "nc nc",
      "O CCO",
      "CCC n",
      "n cccc",
      "CC CCN",
      "nc n",
      "o n",
      "CO CC",
      "CCC Oc",
      "C S",
      "s ccc",
      "ncc s",
      "S Cc",
      "CO CCN",
      "( /",
      "-] )[",
      "CO Cc",
      "c ncc",
      "cnc n",
      "nn nn",
      "S C",
      "CC Sc",
      ")( [",
      "3 4",
      "= [",
      "n ccc",
      "F c",
      "CN Cc",
      "n cccn",
      "N CCN",
      "+]( [",
      "CN S",
      "cc oc",
      "cc nn",
      "CC S",
      "4 3",
      "O CCC",
      "CCN c",
      "Cl c",
      "c nccn",
      "+] =",
      "+] )[",
      "nn n",
      "-] )=",
      "c oc",
      "CCC OC",
      "CCCC NC",
      "nnc n",
      "CC CCO",
      "c nnc",
      "CCCC n",
      "( \\",
      ") /",
      "nn nc",
      "nc nn",
      "CCN S",
      "CC CCOc",
      "O CCN",
      "NCC NC",
      "CO CCn",
      "O CCCO",
      "(\\ [",
      "cnn n",
      "NCC Cc",
      "CCCC c",
      "F C",
      "o ccc",
      "CO CCNC",
      "CO CCOc",
      "N CCCC",
      "CCC S",
      "N CCCN",
      "N CCOc",
      "o nc",
      "ncc nc",
      "NCCC n",
      ")= [",
      "NCC n",
      "CCCC CCC",
      "csc n",
      "cs cc",
      "1 3",
      "+] )(",
      "n sc",
      "CCC Nc",
      "O CCc",
      "OCC n",
      "@@] (=",
      "cn ccc",
      "CCN CC",
      "Br c",
      "CCO Cc",
      "CO CCCNC",
      "CCCCC NC",
      "CO CCC",
      "CO CCO",
      "cc on",
      "s cc",
      "@] (=",
      "CC CCCN",
      "NCCC OC",
      "CCC Sc",
      "O CCCC",
      "sc nc",
      "nc sc",
      "N n",
      "CCN Cc",
      "no nc",
      "O CCCn",
      "CN CC",
      "nnc s",
      "CCO CCN",
      "S CCC",
      "s ccn",
      "(= [",
      "@ ]([",
      "OCC NC",
      "CO CCc",
      "] /",
      "c o",
      "nc oc",
      "CO CCCN",
      "O CCCCn",
      "CC CCOC",
      "N CCO",
      "O CCOc",
      "NCCN c",
      "cnc nc",
      "/ [",
      "oc nc",
      "O CCOC",
      ") -",
      "CCCCC Oc",
      "3 1",
      "ccc nn",
      "n s",
      "OCC Cc",
      "CCCC S",
      "nn sc",
      "CCC OCC",
      "CCO CCCNC",
      "N CCCO",
      "CCOCC NC",
      "N CCOC",
      "4 5",
      "@@ ]([",
      "N CCCCn",
      "N N",
      "NCC S",
      "CO CCOC",
      "CCO CCC",
      "s nc",
      "CN CCc",
      "CCO CCOc",
      "cc s",
      "O S",
      "-] /",
      "CO CCCn",
      "CCCC CCOc",
      "CN CCO",
      "O CCNc",
      "]( /",
      "O CCCNC",
      "\\ [",
      "N CCOCC",
      "cs nn",
      "2 4",
      "CCCN S",
      "NCCC NC",
      "NCC Sc",
      "CCC NCc",
      "NCCC OCC",
      "CCO CCCC",
      "CN CCN",
      "CO CCCC",
      "ccnc n",
      "CCCC CCNC",
      "CCO CCO",
      "CCOCC n",
      "5 4",
      "nc on",
      "N CCCCC",
      "+] )([",
      "CCCC Cc",
      "CCCCC n",
      "O CCCN",
      "nn cc",
      "-] )(=",
      "CCCC Sc",
      "o cc",
      "-] [",
      "CO CCCOc",
      "NCCCC Cc",
      "ncc o",
      "NCCN S",
      "cc no",
      "OCC Sc",
      "cnc s",
      "nnc o",
      "COCCN c",
      "NCCC Oc",
      "NCC CCN",
      "CO CCOCC",
      "-] )(",
      "CCCO CCN",
      "nc ncc",
      "S CCOc",
      "s nnc",
      "4 2",
      "CO CCCOCCN",
      "CN CCC",
      "CCCCN c",
      "O COC",
      "+] /",
      "OCC S",
      "S CCN",
      "NCCC Sc",
      "CCCO Cc",
      "+] \\",
      "S CCCC",
      "CO CO",
      "CN CCOC",
      "CCCN CC",
      "cn oc",
      ") \\",
      ")( /",
      "CCO CCOCc",
      "] [",
      "O CCOCC",
      "NCCC Nc",
      "CO CCCOC",
      "CN N",
      "(/ [",
      "N CCCCCC",
      "CCCC CCn",
      "S CCNC",
      "COCCN Cc",
      "S CCc",
      "CCCC CCN",
      "CCO CCOC",
      "CCCCC O",
      "COCCN CC",
      "O CN",
      "CC CCOCC",
      "cnc o",
      "CCCCC OC",
      "NC N",
      "CO CCOCCNC",
      "N CCOCc",
      "CCO CCCn",
      "O CCCCC",
      "OCCC OC",
      "CCO CCCN",
      "COCCN S",
      "O CCCOc",
      "cnn s",
      "COCC Sc",
      "CCCCN S",
      "I c",
      "o ncc",
      "+] (=",
      "CCCCO CCCNC",
      "NCCCO Cc",
      "CO CCCCCNC",
      "CO CCCNc",
      "CN n",
      "CCCC CCCC",
      "CO COc",
      "COCCO CCN",
      "CCCC CCc",
      "NCC CCNc",
      "OC n",
      "NCC CCOc",
      "COCC S",
      "S CCCc",
      "S CCn",
      "CO CCCCC",
      "NCCC S",
      "cc nnc",
      "COCCC OCC",
      "CCCC CCO",
      "CC CCOCCNC",
      "NN N",
      "CCC F",
      "CO CCCCN",
      "CCCC CCOC",
      "CCCO CCc",
      "NCCN Cc",
      "O CCNS",
      "OCCC Nc",
      ")/ [",
      "NCCCO CCc",
      "CCCC CCCCCCC",
      "OCCC Sc",
      "S CCOC",
      "S CCO",
      "CCCCC Sc",
      "CO n",
      "NCCCN S",
      "CN CCOc",
      "3 5",
      "N CCCCc",
      "CCCCC S",
      "CN CCn",
      "NCCO CCO",
      "OCCN Cc",
      "CO CCCS",
      "S CCCOc",
      "CCO CCCNc",
      "CCCC CCCCCC",
      "CCCO CCOC",
      "CCCCC OCC",
      "CCCCO CCN",
      "COCCO CCCNC",
      "CN CCNC",
      "NCCCC CCC",
      "CCCCC Nc",
      "S CCCO",
      "NCC CCOCc",
      "CCCCCC Sc",
      "CCO CCc",
      "OCC CCN",
      "]/ [",
      "n scc",
      "-] )([",
      "CO CCCc",
      "CN CCCN",
      "s n",
      "O CCCCCC",
      "Cl C",
      "CCCCO CCO",
      "OCCO CCN",
      "CN CCCn",
      "COCCO CCCC",
      "OCC F",
      "O CCCCNC",
      "S CCCn",
      "CCOCC Sc",
      "CCCC CCNc",
      "c onc",
      "CCCC CCCCC",
      "COCCCN S",
      "CCCCN Cc",
      "CCO CCOCC",
      "CN CCCC",
      "CO CCOCc",
      "CN CCCOC",
      "CO CCCCNC",
      "CCCO CCO",
      "CCO CCCOC",
      "SCC Sc",
      "OCCO Cc",
      "cn sc",
      "-]) /",
      "CCOCC S",
      "CCCC CCOCC",
      "( #",
      "CCOCC Cc",
      "]( /[",
      "-])= [",
      "CCO CCCNS",
      "CCCCCN S",
      "NCCCC CCNC",
      "COCCO CCC",
      "CS C",
      "CCCCO CCC",
      "OCCO CCOc",
      "CCCCO CCOC",
      "CCCCO Cc",
      "SCC S",
      "CCN CCN",
      "CCCC CCNS",
      "S Cn",
      "S CCNS",
      "5 6",
      "CN CCCc",
      "C H",
      "OCC CCOc",
      "CCO CO",
      "+] /[",
      "CN CCS",
      "COCCC Sc",
      "C F",
      "5 3",
      "CO CCCCNc",
      "CN CCSc",
      "12 3",
      "NC n",
      "NCCC F",
      "no cc",
      "NCCO CCc",
      "s s",
      "CCCO CCC",
      "COCCO CCCCNC",
      "S CCCNC",
      "NCCO CCC",
      "S CCCCC",
      "1 4",
      "COCCOCC Sc",
      "CCN CCC",
      "CCC OCCNC",
      "COCC CCOC",
      "CCO CCCCNC",
      "OCCC NCc",
      "CCCCO CCOc",
      "S CCOCCO",
      "CCCCO CCOCc",
      "CO CCCO",
      "CCCCN CC",
      "CCO CCNc",
      "O CCCCc",
      "NCCC NCc",
      "S CCNc",
      "COCCC NCc",
      "nn ccc",
      "O CCCNS",
      "S CCCCCO",
      "NCCO CCOC",
      "s ncc",
      "OCCO CCC",
      "nc no",
      "CC F",
      "O n",
      "CCCO CCOCC",
      "NCC CCO",
      "CCCCO CCOCC",
      "NCCCCC OC",
      "OCCCC Sc",
      "CN CCCOCC",
      "COCC CCCN",
      "6 5",
      "CCN CCOC",
      "NN NN",
      "COC n",
      "ncn s",
      "OCCO CCO",
      "CN CCCO",
      "s sc",
      "CCCO CCOc",
      "@@]( /",
      "O CCOCCn",
      "CC CCOCCn",
      "@]( /",
      "COCCCN CC",
      "OCCC OCC",
      "CN CCOCC",
      "S CCCCCn",
      "N CCCCNC",
      "CCCCCCCC CCCC",
      "CCO CCNCc",
      "OCC CCNc",
      "CCN CCc",
      "COCCCC Sc",
      "CCO CN",
      "CCCCO CCCN",
      "cccc cc",
      "CCCCO CCOCCNC",
      "+]) /",
      "CCOCCO CCOCCO",
      "COCC CCOc",
      "CN CCNc",
      "NCC CCOC",
      "N O",
      "CN CCCNc",
      "COCCO CCOC",
      "NCCCC CCCCNC",
      "COCCO CCNc",
      "NCC CCOCCc",
      "S CCOCC",
      "S CCCN",
      "4 1",
      "CN CCCCN",
      "CN CCNS",
      "OCC CCO",
      "CCN CCOc",
      "(- [",
      "OCCOCC Sc",
      "O COc",
      "+] \\[",
      "OCCC S",
      "N NC",
      "SCC CCO",
      "OCCCC CCN",
      "CCO CCCOc",
      "S CCCOC",
      "CN CCCOc",
      "CCOCCC NCc",
      "CO CCCCn",
      "coc n",
      "COCCO CCNS",
      "cs nc",
      "S CCCSc",
      "CCCC CCCNC",
      "OCCN CC",
      "COCCOCC S",
      "ccn s",
      "NCCCCC O",
      "+]( /",
      "CCCCO CCNc",
      "- ](",
      "CCN CCNC",
      "CN CCCCn",
      "S CCCS",
      "S CCNCc",
      "CCN CCn",
      "S N",
      "CN CCCSc",
      "COCCO CCCN",
      "CO COC",
      "Br C",
      "OCC CCCN",
      "CN CCOCc",
      "CCCCC OCc",
      "+] )=",
      "CO CCOCCn",
      "COCC CCCNS",
      "CCO COc",
      "OCCCCC Sc",
      "CCCCO CCCNc",
      "O H",
      "COCCCCC Nc",
      "CCO CCNS",
      "CCOC n",
      "CCCCOCCO CCNc",
      "NCC F",
      "COCCN CCc",
      "NCCCO CCOC",
      "CNCCO CCO",
      "CCN CCO",
      "N Sc",
      "O CCCCCn",
      "COCCN CCN",
      "CO CN",
      "COCCO CCOc",
      "+] =[",
      "SCCC OCC",
      "CO CCCCS",
      "CCOCC CCOC",
      "CCCCOCC Sc",
      "S CCOCCOc",
      "OCCO CCNc",
      "CO CCCCCC",
      "+] #",
      "F CCC",
      "O CCCCCO",
      "OCCO CCOC",
      "CCCCO CCCNS",
      "NC O",
      "CN CCCNC",
      "-] =[",
      "CCCN CCN",
      "CCOC S",
      "S CSc",
      "OCCCC CCn",
      "OCC CCOC",
      "OCCOCC Cc",
      "-]) \\",
      "NCCN CC",
      "CCN CCS",
      "S CCOCCC",
      "COCCO CCCNCc",
      "CCN n",
      "CCCC CCOCc",
      "CCCN CCOC",
      "F CCCN",
      "NC Nc",
      "4 6",
      "S CCCNS",
      "CCO CCOCCC",
      "sc nn",
      "CCOCCO CCOC",
      "# [",
      "N CCOCCN",
      "NC NC",
      "CCN CCSc",
      "CCCN CCC",
      "CCCN CCOc",
      "SCC CCOc",
      "nnn s",
      "N OC",
      "O CCOCCNC",
      "NCC CCCN",
      "CO CCCCCOC",
      "NCCN CCc",
      "CCCCO CCCC",
      "31 4",
      "S CCCCCC",
      "NC NS",
      "CCCC CCCc",
      "+]( -",
      "CCCCOCC S",
      "COC Sc",
      "cn on",
      "CCCO CCCC",
      "COCCO CCCNc",
      "O CCCCCOc",
      "CCO n",
      "CN CCCCNc",
      "SCC CCOC",
      "s snc",
      "CO CCCCc",
      "CCCO CCOCc",
      "S CCCNc",
      "CCCC CCCO",
      "CCCCC NCc",
      "OCCO CCNCC",
      "OCCCO CCc",
      "COCCOCC CCNc",
      "1 5",
      "S CCOCCOC",
      "CCN CCCOC",
      "CCCCC F",
      "CCOCC CCN",
      "CCOCCO CCO",
      "CCCCO CCCn",
      "OCCCC CCOc",
      "co cc",
      "CC SC",
      "CCCCO CCNCc",
      "NCCCC CCO",
      "CCN CCNCc",
      "S CCCCSc",
      "CN CCCCC",
      "CCCCCC CCO",
      "COCCN CCNc",
      "OCCC F",
      "CCCO CCCNC",
      "COCCCN CCNc",
      "C Br",
      "N CCCCCNC",
      "NC S",
      "CCCCCC S",
      "OCCCC CCOC",
      "6 4",
      "F CC",
      "CCCN CCn",
      "OCCO CCOCCO",
      "COCCO CCNCc",
      "] )",
      "NC Sc",
      "CCO CCCSc",
      "CCCC CCCCc",
      "CCOC Sc",
      "CCCN CCS"
    ]
  }
}