{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Nmt"
      },
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": " {2,}"
        },
        "content": " "
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Metaspace",
        "replacement": "▁",
        "add_prefix_space": true
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 2,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "▁",
        -0.6931471808026011
      ],
      [
        "c",
        -2.289498028516334
      ],
      [
        "C",
        -2.3191188737900035
      ],
      [
        "(",
        -3.157145613029357
      ],
      [
        ")",
        -3.157145613029357
      ],
      [
        "1",
        -3.4337494413900735
      ],
      [
        "O",
        -3.8003416456793744
      ],
      [
        "2",
        -3.8354203318153104
      ],
      [
        "N",
        -3.9489619191823486
      ],
      [
        "]",
        -4.114143160310146
      ],
      [
        "[",
        -4.114143160310146
      ],
      [
        "@",
        -4.185726512332149
      ],
      [
        "H",
        -4.201161413116868
      ],
      [
        "=",
        -4.26644820084319
      ],
      [
        "n",
        -4.300186073016661
      ],
      [
        "3",
        -4.824395958274135
      ],
      [
        "+",
        -5.412930408280779
      ],
      [
        "F",
        -5.636658395691338
      ],
      [
        "-",
        -5.944123069167032
      ],
      [
        "S",
        -6.23059354933377
      ],
      [
        "s",
        -6.3086720535935505
      ],
      [
        "l",
        -6.356164827135707
      ],
      [
        "4",
        -6.474778787500576
      ],
      [
        "o",
        -6.5919851676767856
      ],
      [
        "#",
        -7.471440033681638
      ],
      [
        "r",
        -7.600338586268233
      ],
      [
        "B",
        -7.600338586268233
      ],
      [
        "/",
        -8.02057032804323
      ],
      [
        "5",
        -8.905241806184042
      ],
      [
        "\\",
        -9.431656471484382
      ],
      [
        "I",
        -10.348187932078408
      ],
      [
        "6",
        -12.084066778027127
      ],
      [
        "7",
        -15.584016494881563
      ],
      [
        "p",
        -17.628494092721255
      ],
      [
        "8",
        -18.37808350350985
      ],
      [
        "P",
        -19.003564863395415
      ],
      [
        ".",
        -20.190108874992006
      ],
      [
        "9",
        -21.023442208325346
      ]
    ]
  }
}